{
  "posts": [
    {
      "publishedAt": "2012-04-11T23:21:56.000Z",
      "publishedAtHuman": "2 years ago",
      "publishedAtFormal": "12th April 2012",
      "year": "2012",
      "month": "04",
      "slug": "time-for-some-new-adventures-part-2",
      "title": "Time for some new adventures (part 2)",
      "path": "posts/2012-04-time-for-some-new-adventures-part-2.html",
      "tags": [
        "finn",
        "oom"
      ],
      "content": "<p>Perhaps “New Adventures” is the wrong phrase as I’m now well into my third month of this particular endeavour, but sticking with the theme I’m pleased to announce that I am now Head of Digital for <a href=\"http://www.finncomms.com\">Finn</a>! It’s a bit of a departure from working for a web design agency (for those that don’t know, Finn are traditionally known as a PR agency) but it’s a grand adventure and one that I’m excited to be part of.</p>\n\n<!-- more -->\n\n<h2 id=\"fromcreativedirectortoheadofdigital\">From Creative Director to Head of Digital</h2>\n\n<p>In my previous role at Order Of Magnitude (OOM) I was heavily involved in working directly with clients who, in the main, tended to be other agencies that required web creative or web development. Finn was one such client and we worked together on websites, social media applications and email marketing campaigns.</p>\n\n<p>In the six months running up to my departure we had built a social media, geo-location powered treasure hunt for Fox’s Puddings, a web presence for Nouvelle, social media applications for Morphy Richards, Lovetub and Blue Diamond Almonds as well as completely rebuilding Finn’s own website. The work was great (and the other guys at OOM played no small part in their success) and it started to become clear that Finn were more than just a standard PR team, they were producing content that people wanted to consume and was best delivered digitally.</p>\n\n<p>Shortly before Christmas 2011, Richard approached me about joining their team to help them deliver these projects internally. The idea wasn’t to build a full-service digital agency, it was to have a core team of thinkers and creators that would bring in the best partners to fulfil the job at hand. As hard as it was to say goodbye to OOM, the proposition and potential for <a href=\"http://www.finncomms.com/our-services/social-media/\">Finn Digital</a> (as it is currently known) was too great an opportunity to turn down.</p>\n\n<p>So here I sit, Head of Digital for one of the fastest growing PR agencies[1] in the country, a company stuffed full of talent, awards and fantastic clients. It’s all a bit daunting if I’m honest![2]</p>\n\n<h2 id=\"workingwithcontentcreators\">Working with Content Creators</h2>\n\n<p>The main thing that gets me excited about working for Finn is the Content First nature of PR. While it is my job to make sure that the digital medium is used to its full potential (and that anything we build is both beautiful and technically rock solid) the rest of the team are there to create the ideas that will get our clients noticed. It’s no good to know how to build the best looking website, you’ve got to know what users want to consume. To quote Finn’s MD Richard Rawlins,</p>\n\n<blockquote>\n  <p>“Finn Digital’s proposition is to blend art and science: the art of consumer insight, content and conversation combined with the science of technology to deliver it and measure its success.</p>\n</blockquote>\n\n<p>We apply the PR agency art of marrying consumer insight with the brand agenda to produce awesome relevant content which creates conversations.”</p>\n\n<p>PR could be likened to SEO in many ways, after all, we are essentially trying to drive natural traffic to our clients’ websites to increase their profile and, ultimately, make more money. We aren’t, however, solely following a traditional SEO route of on-page optimisation and link-building, instead we are creating compelling content that uses the power of social media and word of mouth to get people excited about a brand.</p>\n\n<p>Creating content that gets people talking (and sharing) is not easy, but the team at Finn has proven time and time again that they know how to generate an idea that works. We know it’s not just about how many people see something, it’s how many people are moved to talk, to share, to engage that matters and by creating content which people of influence want to share, we create the positive reputations, sentiment and engagement which Google craves.</p>\n\n<h2 id=\"whowellbeworkingfor\">Who we'll be working for</h2>\n\n<p>Finn has a fantastic client list, including household names such as <a href=\"http://www.finncomms.com/case-study/retail-making-a-brand-more-social/\">Morphy Richards</a>, <a href=\"http://www.finncomms.com/case-study/frozen-increasing-awareness-of-a-promotional-campaign/\">Fab Ice Lollies</a>, <a href=\"http://www.finncomms.com/case-study/social-media-using-social-to-raise-awareness-around-npd/\">Fox’s</a> and <a href=\"http://www.finncomms.com/case-study/retail-protecting-listings/\">Nouvelle</a>, and the digital team are already hard at work with social media applications, community management and several website builds.</p>\n\n<p>We’re working with such diverse topics as recycled toilet rolls, hair straighteners, frozen yogurt and vacuum cleaners, so there’s never a dull moment (being a designer is great for becoming an overnight hack on a huge range of topics)!</p>\n\n<p>Within these projects we’re using tech and skills including HTML5, CSS3, the Facebook Graph API, Facebook’s Open Graph, Twitter, geo-location, Instagram (and it’s API), Adobe Flash (it’s still alive and kicking!), display advertising, viral content and seeding, PPC, SEO, Content Strategy and coffee! So there’s loads of new and interesting things to be investigating, prototyping and building with - if only there was more time in the day!</p>\n\n<h2 id=\"andsotothefuture\">And so to the future</h2>\n\n<p>With nearly three months gone already, this new adventure is well and truly underway. It’s been hectic, creative, educational, long hours (at times) and hard work but it’s been thoroughly worth it, every second, and I can’t wait to see what happens next!</p>\n\n<h3 id=\"jointheteam\">Join the team</h3>\n\n<p><em>If you like the sound of what we’re doing at Finn then get in touch, we’re always on the hunt for talented people to <a href=\"http://www.finncomms.com/join-the-finn-digital-family/\">join the digital team</a>!</em></p>\n\n<hr />\n\n<p>[1] Named in the PR Week 2011 Top 150 as fastest growing PR Agency outside London\n[2] Daunting and exciting in equal measure, I love a challenge and I know that in Finn we’ve got the team to produce brilliant digital work.</p>"
    },
    {
      "publishedAt": "2012-01-22T12:14:12.000Z",
      "publishedAtHuman": "3 years ago",
      "publishedAtFormal": "22nd January 2012",
      "year": "2012",
      "month": "01",
      "slug": "time-for-some-new-adventures-part-1",
      "title": "Time for some New Adventures (part 1)",
      "path": "posts/2012-01-time-for-some-new-adventures-part-1.html",
      "tags": [
        "Conference",
        "Inspiration",
        "New Adventures",
        "web design"
      ],
      "content": "<p>Yesterday saw the second New Adventures in Web Design, organised by Simon Collison (Colly) and Greg Wood. In his editorial piece in the conference newspaper, Colly said he'd vowed \"never again\" after last year's conference, but that he was talked into doing it all over again by Greg over a few jars of ale. Thanks Greg, you were right to bully Colly as it would have been criminal if this fantastic event hadn't happened again.</p>\n\n<!-- more -->\n\n<p>The format is somewhat unique, 8 speakers in one room (with a massive organ) punctuated by Q&amp;A sessions, coffee, lunch in a bag and, new this year, awesome cupcakes. The conference itself lasts a day and includes a pretty decent after-party in the trendy Lace Market area of the city. I can't comment (as I didn't go) on the workshop day or the frootball tournament (which is happening while I'm typing this on a train) but I would assume that they both lived up to the high standards of the rest of the event.</p>\n\n<h2 id=\"thespeakers\">The Speakers</h2>\n\n<p>As with the 2011 event the line-up had some huge names from the world of web design. I was particularly keen to hear Dan Mall and Trent Walton speak, having seen and admired their work for several years. That doesn't mean that I wasn't looking forward to hearing the other speakers, especially Robbie from FreeAgent (software that I use regularly and love to bits).</p>\n\n<p>The topics covered were all cerebral, as noted by Colly in the paper, \"…talks that make attendees work a bit harder; the full impact not necessarily hitting us until days, weeks or months later\". This isn't an event that aims to teach you how to animate DIVs with CSS3 transitions.</p>\n\n<h2 id=\"somethemes\">Some themes</h2>\n\n<p>Although independent, the talks normally include several themes that are repeated throughout the day. This year, it seemed that the speakers were all trying to encourage downtime, tinkering, broadening experiences, making opportunities for creativity, smarter working practices and a diminishing focus on tools, all things that firmly resonate with how I think about what I do as a maker for the web.</p>\n\n<p>Sadly my notes aren't as exhaustive as they could be from all the talks, so I'll do my best to sum up what I thought and what I've personally taken away from them, but apologies to any speakers that are not covered in as much depth.</p>\n\n<h2 id=\"danmalldanielmallhttpwwwtwittercomdanielmall\">Dan Mall <a href=\"http://www.twitter.com/danielmall\">@danielmall</a></h2>\n\n<p>Dan Mall was perhaps the most explicit in his discussing of process, giving several examples of projects where he was working for clients and one where he swapped roles and became a client (for the development of his own website).</p>\n\n<p>Dan focused his talk around relationships, be that client to designer or content to content, and some key phrases jumped out at me:</p>\n\n<ul>\n<li><p>\"Humans > Algorithms\"</p></li>\n<li><p>\"Your client has to be your partner - they aren't an extension of your team, they are your team\"</p></li>\n<li><p>\"Sites need <strong>smarter</strong> work, not <strong>more</strong> work\"</p></li>\n<li><p>\"Create empathy, become a client\"</p></li>\n<li><p>\"Enjoy yourself\"</p></li>\n</ul>\n\n<p>He also spoke about the \"Invisible Deliverables\" that he and his team have produced during projects. The motion comps that explain transition animations, the quick (fake) CMS that helps to define subjective qualities of items on a site, the cartoon flip book to help explain tagging, etc. - and it was fascinating (and reassuring) to see other people using techniques that I have used in my design process.</p>\n\n<p>I can't claim solo ownership of my own \"invisible deliverables\" having been bullied into creating tools to aid the creative process by my good friend Nick (<a href=\"http://www.twitter.com/makeusabrew\">@makeusabrew</a>), but I can say that thinking about a problem and the best way to <em>offer</em> a solution has led to some of my most effective work to date. Suffice it to say that I totally agree with Dan's statement, that \"the client facing deliverable isn't always the most important thing to make\".</p>\n\n<h2 id=\"naomiatkinsonnaomisusihttpwwwtwittercomnaomisusi\">Naomi Atkinson <a href=\"http://www.twitter.com/naomisusi\">@naomisusi</a></h2>\n\n<p>Naomi and her semi-geordie twang took to the stage to make us think about \"Going Beyond\" with a talk designed around celebrities and their brands. This covered topics including self-promotion and marketing, but also focused on using our skills to make the world a better place (whilst making some money).</p>\n\n<p>Using examples including Katie Price and Jamie Oliver, Naomi clearly walked us through evolving a brand to get noticed by anyone, an industry or a company. I thought she was a bit too obvious at times about getting yourself in front of a company or an industry, but the overall points made were sound advice. In particular, I thought the breakdown of how to get noticed by anyone was very good, splitting it down into categories:</p>\n\n<ol>\n<li><p>Reference (linkedin, about.me)</p></li>\n<li><p>Portfolio (dribbble, website)</p></li>\n<li><p>Opinion (twitter, blog)</p></li>\n<li><p>Products (pulley, bigcartel)</p></li>\n<li><p>The real world (just get out there and meet people!)</p></li>\n</ol>\n\n<p>This comes down to a phrase that she used a couple of times \"being everywhere\", though I would build on that to say that your \"everywhere\" should be a well-considered subset of all available places. Curate your networks to make sure you have time to keep them all up to date as we are all busy people and having 10+ social profiles to update is too much like hard work.</p>\n\n<p>I'll also echo what Naomi said about giving something back to the wider community. There is still money to be made in doing work that is for <em>the greater good</em> and aiming to use our skills to do better is a noble ambition. I've certainly turned down work in the past that was based around dark patterns and using my talent to help claw more money out of people who really couldn't afford to lose it and I'd hope that all readers of this blog would do the same.</p>\n\n<p>This is definitely one of those \"days later\" talks that Colly was referring to, as at the time I thought her examples were a bit obvious and limp. However, going back over my notes and thinking more about how this applies to my craft and my opinions, I've found that Naomi has sparked thoughts about my involvement in our family charity and how to do more little things to improve the area and community that I'm in.</p>\n\n<h2 id=\"travisschmeisserrockthenrollhttpwwwtwittercomrockthenroll\">Travis Schmeisser <a href=\"http://www.twitter.com/rockthenroll\">@rockthenroll</a></h2>\n\n<p>Unfortunately, Travis' talk was one that I have very few notes from. I found it quite difficult to follow the thread that he was using and as a result zoned out a little and ended up thinking about personal projects and work a bit too much. I do, however, remember his one slide that said \"loosen the fuck up\" and while the swearing was perhaps a bit much for public speaking, I do remember nodding in agreement.</p>\n\n<p>What I did take away was an idea that we've allowed ourselves to get too uptight and safe with our work. There's too much focus on getting more followers, the bigger job or the better client and instead we should be looking to get back to the original excitement that was felt when starting out in this journey. From my notes:</p>\n\n<blockquote>\n  <p>How did we get to this point where we are safe? How do we get back to the pure enjoyment and excitement we had when we were younger?</p>\n</blockquote>\n\n<p>So let's take a step back from chasing more followers on twitter, getting more readers on our blogs and more hearts on dribbble. Instead, let's get together and just have some fun.</p>\n\n<h2 id=\"robbiemansonrougeberthttpwwwtwittercomrougebert\">Robbie Manson <a href=\"http://www.twitter.com/rougebert\">@rougebert</a></h2>\n\n<p>Robbie is a young designer from Scotland that works for FreeAgent, an online accounting startup based in Edinburgh. I've not heard him speak before and by all accounts he's a new face on the speaking circuit. Given the response he got I think we'll be seeing him a lot more in the future.</p>\n\n<p>He spoke with an intense, considered style, pausing regularly to let his words sink in, allowing us to fully process his beautifully put together slides.</p>\n\n<p>Robbie started by talking about 2001: A Space Odyssey (which I should shamefully admit to not having watched). His point was about humanising tools, to the point where the humanity was being lost from us as a species. This led on to talking about Time To Screen (TTS) and Time To Tool (TTT), the concept of how long it is after waking up in the morning before we see a screen, or how long after getting a brief or an idea we jump to a tool to start creating.</p>\n\n<p>The TTT discussion led on to thoughts about how CSS is not a tool for creativity, how graphics applications are still more effective for producing \"happy accidents\" and experimentation and how failure is valuable - so long as you learn from it.</p>\n\n<p>He echoed previous sentiments that we are becoming pre-occupied by tools and that it is increasingly easy to substitute better thinking about a problem for a new tool. Interestingly, Robbie provided some examples of how to achieve better thinking, showing the audience how he uses 6-up sketching, printing, regular computer breaks and team work to make a more considered design.</p>\n\n<p>By not doing something by hand, you somehow don't commit the work to memory so completely. You make more mistakes. The computer understands the drawings, but do you?</p>\n\n<p>He showed how the team at FreeAgent had thought around the problem of showing customers what they were working on, and talked through the delightfully illustrated \"Depot\" that was their final solution. I've used the depot regularly to get an idea of what is on their radar and comparing my experience to what Robbie was saying, they've hit the nail on the head with it.</p>\n\n<p>Robbie's talk finished with him taking us through a painful few months where he was forced to slow down and \"refuel\". After jumping from a mezzanine floor and shattering his heel, Robbie had to take an extended period off work, giving him time to think and consider how he approaches design and what it was he wanted to do. This story had some great elements to take away, not least the statement:</p>\n\n<blockquote>\n  <p>You can't live in the fast lane too long, you'll run out of fuel.</p>\n</blockquote>\n\n<p>The last words were the most important, however, \"remember, it's just people designing for people\".</p>\n\n<p>This was a really impressive talk and one that I'm certain to have done a poor service of summarising properly here. So I can only recommend that you pester Colly to post the video online, or, at the very least, to get Robbie to post his slides. You will be a better designer for seeing it.</p>\n\n<h2 id=\"trentwaltontrentwaltonhttpwwwtwittercomtrentwalton\">Trent Walton <a href=\"http://www.twitter.com/trentwalton\">@trentwalton</a></h2>\n\n<p>Trent flew over for New Adventures from Austin, Texas and I'm so glad that he made the trip. Sadly, I didn't attend his workshop on web type the previous day, but his talk was up there as one of the best of the conference. The guy is an absolute star, with great thinking, bags of talent and a really awesome way of communicating what's in his head to an audience that soaked up every word he uttered.</p>\n\n<p>The talk was titled \"Break Everything\" and the first part focused on sharing his childhood with us. We learnt about how his Dad loved to renovate and race old cars, build new structures and rooms for their house and generally take things apart and re-build them.</p>\n\n<p>It wasn't immediately obvious how this was related to the web industry, but slowly it was revealed and it made an awful lot of sense. Breaking things is important.</p>\n\n<p>We break things to identify limitations, to develop an understanding and to allow us to make things better. We break rules for the sake of progress - what would the web look like if no-one went out-of-bounds?</p>\n\n<p>Trent showed us through his \"breaking\" which included experimentation with better typography for the web and, more recently, responsive web design. He explained that while breaking stuff wasn't always fun, it was necessary, and it was through breaking his process and starting from scratch that he slowly, and painfully, found a way to make responsive websites.</p>\n\n<p>As he so exactly stated, responsive design isn't bolt-on. We can only understand it by getting involved, we must think in proportions and not pixels and we must let go of Photoshop. Amen.</p>\n\n<p>It was great to see how Paravel, a small web shop that Trent is 1/3 of, was working to create amazing sites, with strong hierarchy and visual standards that were also featuring leading web technology such as responsive design, media queries, web typography, fluid images and videos, etc. It was also inspiring to hear how Trent viewed sharing his findings and the importance of community, movingly explained through a story about a funeral from his childhood.</p>\n\n<p>His parting words were \"Community is everything, participate\" and I couldn't agree more.</p>\n\n<h2 id=\"cameronkoczonfictivecameronhttpwwwtwittercomfictivecameron\">Cameron Koczon <a href=\"http://www.twitter.com/fictivecameron\">@fictivecameron</a></h2>\n\n<p>Cameron has an electric personality, full of charisma and energy, you could feel the room immediately warm to him. I guess I'd describe him as my stereotypical vision of a New Yorker, bold, confident and loud!</p>\n\n<p>He talked through his thoughts about the role that design plays in a business and how \"everyone should be an entrepreneur\". He declared 2012 to be the \"year of design\" as companies and startups are increasingly seeing that design is the most important aspect of their business. He was, however, keen to point out that \"Design does not equal decoration\". Very true.</p>\n\n<p>My notes from Cameron's talk were almost all calls-to-action, including things like \"found a startup (this is hard)\", \"join a startup (this is easier)\", \"mind your identity\", \"support one another\", \"successful designers reinvest\" and \"see it through to the end\". Rousing stuff, and all things that I have resolved to take with me as I look to make progress with my career this year.</p>\n\n<p>Perhaps the biggest thing that Cameron said, and something that I think all businesses would be wise to consider, was you should see \"Design as a partner, from the beginning, with equity\". To paraphrase Trent Walton, it's not bolt-on.</p>\n\n<h2 id=\"denisejabcobsdenisejacobshttpwwwtwittercomdeniseroberts\">Denise Jabcobs <a href=\"http://www.twitter.com/deniseroberts\">@denisejacobs</a></h2>\n\n<p>I'm not sure what to say about Denise's talk as it was among the more surreal experiences I've had at a conference. Presented in the form of a story, Denise took us on journey to escape from Cubicalia to find our brain in Wuzzy Wuzzy via The Land Of The Laughing Buddah and ending up in Betterbalancia. It was a bit on the crazy side.</p>\n\n<blockquote>\n  <p>Where are we? Wuzzy wuzzy, cubicalia, betterbalancia or the land of the laughing Buddha? Help!? <a href=\"https://twitter.com/search/%2523naconf\">#naconf</a></p>\n</blockquote>\n\n<p>— Ian Thomas (@anatomic) <a href=\"https://twitter.com/anatomic/status/160043267608686593\">January 19, 2012</a></p>\n\n<p>Hidden among the sound effects and weird storytelling there were some really good insights and rather than trying to explain the story, I'll just cover them off in short form here.</p>\n\n<ul>\n<li><p>Stop overthinking, slow down and get your brain into alpha mode.</p></li>\n<li><p>Allow creativity to come on to you, rather than rushing to find an answer while your brain is in beta mode.</p></li>\n<li><p>Play more, relax and let your brain and soul work together in their own way.</p></li>\n</ul>\n\n<p>Perhaps I'm too rigid and stuffy to fully appreciate a talk like Denise's but I eventually found it all a bit much and retreated to the comfort of following the dry humour from the audience on Twitter. At least it wasn't just me that was struggling to get a grip on what was happening!</p>\n\n<h2 id=\"frankchimerofchimerohttpwwwtwittercomfchimero\">Frank Chimero <a href=\"http://www.twitter.com/fchimero\">@fchimero</a></h2>\n\n<p>Frank was the last speaker of the conference and perhaps the most eagerly anticipated by all the designers in attendance. Frank has built an admirable reputation as highly intelligent designer and with his recent success in getting funding for his book \"The Shape of Design\" via Kickstarter (with $112,159 in pledges) and his presentation had all the hallmarks of classic Chimero.</p>\n\n<p>He started off by showing a photo he took in an Apple Store where a woman had brought a small pony in with her. Seemingly invisible to the rest of the store, Frank noticed and photographed this pony and used this story to segue neatly into another photograph (or set of photographs) from the 1800s.</p>\n\n<p><img src=\"http://www.ian-thomas.net/wp-content/uploads/2012/01/eadweard-muybridge-horse-300x162.jpg\" alt=\"Muybridge Horse Sequence\" title=\"\" /></p>\n\n<p>These photos are extremely famous now, as it was a series of shots of a galloping horse, taken to settle a bet between gents, but having a much bigger overall importance as it was the first time that someone \"split the second\" and captured movement over time.</p>\n\n<p>Frank used this as a way to get into the meat of his talk, discussing what makes a design \"good\" and how space and motion are the most important elements to consider. <em>Gaps between things allow movement.</em></p>\n\n<p>He talked about how spacing between letters affected our experience of the words, how doors represent opportunities, transformation and change and how design is about the journey from A to B, but neither A nor B. In essence, it is \"the bits in-between\".</p>\n\n<p>As with Robbie's talk, hearing Frank speak was enlightening and inspiring, so much so that my notes were few and far between so again I'd recommend anyone that has an interest tries to find his slides or a video of the talk - it will be worth your while to.</p>\n\n<p><img src=\"http://www.ian-thomas.net/wp-content/uploads/2012/01/Chimero_position_graphic.png\" alt=\"\" title=\"\" /></p>\n\n<p>The above graphics were part of Frank's conclusion as to the role of design and it's placement in life and I think they are an excellent representation. The last thing I'll mention is something that I've heard from Frank before, and something that echos one of Robbie's points from earlier in the day, \"It's [design] just people all the way down.\"</p>\n\n<h2 id=\"summingup\">Summing up</h2>\n\n<p>New Adventures 2012 was a great experience all round. A fantastic opportunity for me to go \"home\" and see old friends, drink too much and stay up way too late, a chance to explore my thinking about web design and the role I play in the overall community and a chance to meet some fantastic new people.</p>\n\n<p>After the talks had ended for the day I retreated to the Old Market Square for a coffee and to collect my thoughts, which lasted about fifteen minutes before heading up to the Lace Market for a cosy dinner with some web friends old and new (\"How do you know each other?\" \"We met on twitters.\" \"Standard.\")</p>\n\n<p>It was a great day, topped off with meeting a bunch of really nice, interesting people and a few cheap drinks courtesy of Colly and Greg. I hope there isn't the need to bully Colly into putting it on again next year, and if he does I'll be first in the queue to get myself a ticket.</p>"
    },
    {
      "publishedAt": "2012-01-17T16:06:16.000Z",
      "publishedAtHuman": "3 years ago",
      "publishedAtFormal": "17th January 2012",
      "year": "2012",
      "month": "01",
      "slug": "a-focus-on-the-web-design-process",
      "title": "A Focus On The Web Design Process",
      "path": "posts/2012-01-a-focus-on-the-web-design-process.html",
      "tags": [
        "process",
        "Project Management",
        "Tools",
        "web design"
      ],
      "content": "<p>If you are anything like me you often find yourself pondering the best way to get something done. That something could be how to grow the nicest lawn, ride the perfect line down a rocky trail, pour the perfect pint or write the most semantically sound HTML and CSS. Ok, so maybe they are just me, but certainly one of the things that commands my attention more often than not is the web design process.</p>\n\n<!-- more -->\n\n<p>Recently (let's say the past 12 months) my view on web design has changed in several ways. Firstly, I've strongly moved away from thinking that you must know certain tools to be good a making websites. The very idea that knowing how to use Photoshop™ exceptionally well or that you know every PHP function under the sun makes you a good designer/developer is something I've come to firmly disagree with. Secondly, and perhaps most importantly, I've come to realise that your process and being able to accurately explain or document it is hugely important. Understanding the process inherently gives you a foot up in understanding what you are doing when solving problems - which is, after all, what we are here to do!</p>\n\n<h2 id=\"solvingyourownproblems\">Solving your own problems</h2>\n\n<p>As designers and developers we are problem solvers. We take our brief from clients and put our grey matter to work to find the most elegant and effective solution. When it comes to solving our own problems though, we are often not so great.</p>\n\n<p>Finding your perfect process is a great exercise in problem solving and it is certainly something that we should all dedicate time to on a regular basis. It has all the hallmarks of a juicy brief; internal goals, external goals, internal constraints, external constraints, technology limits, etc. so it is amazing that so many people still don't have a properly thought out process (or a process full-stop!)</p>\n\n<h2 id=\"identifyingthegoalsofawebdesignprocess\">Identifying the goals of a web design process</h2>\n\n<p>Quite simply the main goal of the web design process is to produce a visually rich, engaging, usable website that allows both user and business to achieve their goals as identified in the project's research phase. (Did I just say simply?!)</p>\n\n<p>Building on this statement, the over-arching goal for a web design process is:</p>\n\n<blockquote>\n  <p>Have a documented and repeatable set of actions that allows clients and web designers to work together to produce a web site that fulfills business and user goals.</p>\n</blockquote>\n\n<p>To be more fine-grained our process needs to:</p>\n\n<ul>\n<li><p>Identify the business and user goals</p></li>\n<li><p>Research competitors and identify their strengths and weaknesses</p></li>\n<li><p>Create a content strategy that is effective for both users and SEO</p></li>\n<li><p>Produce a site architecture that contains the content in a structured, logical and usable way (also known as Information Architecture)</p></li>\n<li><p>Include wireframe layouts for the most important use cases (more and more this includes understanding how the content will be displayed on tablets and mobile devices)</p></li>\n<li><p>Create semantically correct, HTML and CSS</p></li>\n<li><p>Apply a graphical sheen / creative layer to make the site visually stunning</p></li>\n<li><p>Build a performant and maintainable back-end system (using the most appropriate language and technology stack for the project)</p></li>\n<li><p>Test both the technical and usable nature of the web site</p></li>\n<li><p>Review and appraise the effectiveness of the project</p></li>\n<li><p>Provide a mechanism for identifying and implementing future improvements to the website</p></li>\n</ul>\n\n<p>These elements do not necessarily need to happen in this particular order, however, this is <em>my</em> preferred method of working as it places the greatest emphasis on identifying and designing for users' goals.</p>\n\n<h3 id=\"asidestepintotherealmofpitching\">A side-step into the realm of pitching</h3>\n\n<p>It is my belief that pitching is one of the biggest reasons that web design projects fail. More often than not, the team producing work for the pitch is trying to solve a problem in isolation and it sets up the project in completely the wrong way.</p>\n\n<p>I'm sure we've all experienced this scenario, the tender document comes in and the list of deliverables specifies at least one homepage design, potentially with an inner page thrown in for good measure.</p>\n\n<p>This is totally wrong.</p>\n\n<p>By entering into this tendering scenario you remove the most critical steps from your process (the research, content strategy, IA and prototyping) and instead jump straight into window dressing content that you have no background knowledge of.  You may be able to scrape some time together to do a bit of research but ultimately this beauty contest is focused on the client and not their end users.</p>\n\n<p>In this situation I would strongly urge that you kick back and explain that you will provide case studies and pitch the client your process, as it is only by following the steps outlined above that you can come to an effective solution.</p>\n\n<p>This is, of course, an idealistic stance to take (and not always possible) but truth be told if a business is more focused on getting something for them than their users then the project is going to be very hard work.  If they don't understand or don't want to pay for the \"thinking part\" of the project then I'd suggest that the whole thing is not going to end well for either party. Remember, you are there to produce solutions to problems, not simply create a pretty picture in Photoshop.</p>\n\n<h2 id=\"managingyourprocess\">Managing Your Process</h2>\n\n<p>We are all human, we are all liable to forget things or make a mistake (what do you mean it's just me?!) so it is necessary to have a system in place to help us manage our ideas, tasks and feedback. This system could be anything, post-it notes, a diary, a Filofax, a calendar on your computer, a Kanban board or some web-based software - there are a million different options, all of which have their pros and cons (and all of which have a strong body of advocates).</p>\n\n<p>Through the years I've favoured a computer based solution using web-based and desktop software solutions. Most recently I've used <a href=\"http://basecamphq.com/\">Basecamp</a> (works for some, not for me), <a href=\"http://www.omnigroup.com/products/omnifocus/\">Omnifocus</a>, <a href=\"http://notableapp.com/\">Notable</a>, <a href=\"https://www.chiliproject.org/\">Chiliproject</a> (a fork of <a href=\"http://www.redmine.org/\">Redmine</a>) and latterly <a href=\"https://trello.com/\">Trello</a> from <a href=\"http://www.fogcreek.com/\">Fog Creek</a>.</p>\n\n<p>Using all these various systems has lead me to the following understandings, which I hope will be of use to others in their quest to get a solid workflow.</p>\n\n<ul>\n<li><p>Any tool is only useful when it is kept up-to-date</p></li>\n<li><p>More features doesn't necessarily equate to more productive</p></li>\n<li><p>Version control integration is important</p></li>\n<li><p>Email notifications and responding via email is not</p></li>\n<li><p>Work as if you are in a big team, even if it is just you</p></li>\n<li><p>Time tracking is useful for business goals but rarely used to inform planning/proposals*</p></li>\n<li><p>A tool may be clever, feature the best tech and have the nicest interface but if your client doesn't want to use it, it's going to be hard work keeping it current if it requires more than five minutes to update.</p></li>\n</ul>\n\n<h2 id=\"bepragmatic\">Be pragmatic</h2>\n\n<p>It might appear that the management of web projects is a lot of effort, strewn with problems and pitfalls but in reality it isn't, as long as you keep things simple.</p>\n\n<p>Here are some tips based on what I've learned from developing my own web design process. (Note that I am pretty much using Trello in isolation now so these tips are biased towards that style of tool).</p>\n\n<h3 id=\"startwithahighleveloverviewandadddetailonlywhennecessary\">Start with a high level overview and add detail only when necessary</h3>\n\n<p>Don't immediately start hammering out the most fine-grained tasks, instead make sure you have a good overview of everything that is going on with your work first. Ideally, you can get an instant overview of all your projects in one place, and then view individual projects in more detail elsewhere if you need to.</p>\n\n<h3 id=\"planforcollaboration\">Plan for collaboration</h3>\n\n<p>You shouldn't expect your clients to use your project management system (though if they do that's a bonus) but you should expect any team members to be fully up to speed with any software that you use.</p>\n\n<h3 id=\"lettheclientcommunicateintheirpreferredway\">Let the client communicate in their preferred way</h3>\n\n<p>If they email you with assets and thoughts, that's fine. If they feedback via powerpoint presentations, that's fine. If you are sent print-outs with scribbles on followed by a phone call, that's fine.  Fit to their preferred way of communicating.</p>\n\n<p>This isn't to say that you shouldn't try and improve communication flow if you can, but typically people have a fairly set way of working so you should make sure that you can accomodate it.  The key thing is that you document their feedback and assign appropriate actions / store assets etc. so the project is in the state you want it in.</p>\n\n<h3 id=\"buyagoodscanner\">Buy a good scanner</h3>\n\n<p>Scribbles on paper are still hugely effective for thinking a problem through, and notes from client meetings or impromptu chats with people in the team are extremely valuable to a project so don't chance losing them! Buy a good scanner and get paper notes into electronic form for tagging and archiving (and by good I mean high resolution and fast!).</p>\n\n<h3 id=\"createyourownbrandedtemplates\">Create your own branded templates</h3>\n\n<p>You may think that your scribbles are too scruffy to present to a client but more often than not they are perfectly fine if done on nicely branded paper. It's one of the reasons I created my own <a href=\"http://www.ian-thomas.net/design-utilities-wireframing-template/\">wireframing template</a>. A quick (and often dirty) sketch with highlights courtesy of some lovely Copic markers has often saved hours in <a href=\"http://www.omnigroup.com/products/omnigraffle/\">Omnigraffle</a>.</p>\n\n<h3 id=\"produceelectronicdocumenttemplates\">Produce electronic document templates</h3>\n\n<p>Having identified the different phases in your design process you'll know what deliverables are expected to be sent to a client. Make life easy by creating template versions that can be grabbed from a central resource hub.  This reduces time spent setting everything up and gives all your client facing documents a consistant look and feel.  N.B. Consistent design and branding is important, but not as important as the content held in the documents, often simple and neat is better than spending too long dressing up client documents.</p>\n\n<h3 id=\"keepeveryoneuptodatewiththeproject\">Keep everyone up-to-date with the project</h3>\n\n<p>Depending on the nature of a project you may find that certain parts of the process can last for several weeks so it's important that stakeholders and team members are given updates regularly. It helps keep everyone involved, motivated and most importantly helps show your client how their money is being spent.</p>\n\n<h3 id=\"ifacommunicationcontainsassetsordocumentscheckthemassoonastheyarrive\">If a communication contains assets or documents, check them as soon as they arrive.</h3>\n\n<p>That next phase of the project may only take a few hours, but if the deadline is looming and you find the assets aren't usable you're going to look a bit silly. Check everything you are sent as soon as you can and make sure they are safely stored ready for use later.</p>\n\n<h3 id=\"keepallprojectfilestogetherinversioncontrol\">Keep all project files together in version control</h3>\n\n<p>Someone should be able to download the project and have everything available to them without needing to go hunting elsewhere. This includes any basic database fixtures, .ini files, login details etc. etc.</p>\n\n<p>Version control provides the best place to store this as it means that you can record who has made changes and roll-back if something goes horribly wrong. All team members should be comfortable with creating, updating and deleting files and repositories; even if it's just a very basic usage, it's better than nothing.</p>\n\n<p>I highly recommend <a href=\"http://git-scm.com/\">git</a>, though I would suggest that if you are creating large binary files (such as Photoshop™ documents) you investigate the best way to push and pull these without compression as they require lots of RAM!</p>\n\n<h3 id=\"keeppasswordssecuretoexternalpartiesbutavailableinternally\">Keep passwords secure to external parties, but available internally</h3>\n\n<p>The last thing you need is for the database server to go down and have no way of rescuing it if Big John (or whoever knows the password) is on holiday. It's also important to document any processes or procedures that need to be followed to get everything back if the shit really hits the fan.</p>\n\n<p>This applies even if you are a one man band, in fact, <strong>it's even more important</strong>.</p>\n\n<h3 id=\"backupabsolutelyeverything\">Back up absolutely everything</h3>\n\n<p>You've got a deadline and your computer breaks. It's not a problem though because you can just download the Photoshop™ trial and the repository again can't you? If you can't, then your work isn't properly backed up and you need to do something about that <em>right now</em>.</p>\n\n<h3 id=\"spendtimereviewingaprojectafterithascompleted\">Spend time reviewing a project after it has completed</h3>\n\n<p>You've completed the work and (hopefully) the client loves it, congratulations! Now schedule a meeting and review exactly what went well, what could have been better and what can be extracted from the project and put into your resource hub for use in other projects.</p>\n\n<p>This is a crucial step in the project lifecycle as it affords you the chance to refine your process and make sure that all future projects are even better than before.</p>\n\n<h2 id=\"themissingbits\">The missing bit(s)</h2>\n\n<p>One aspect that I have left out is prototyping and that's mainly because, sadly, there is normally neither the time or budget to effectively prototype an idea.</p>\n\n<p>I personally spend time playing with tools and ideas outside of work (sometimes inside work but don't tell my boss) and it's these 'spikes' that help me find new techniques or decipher exactly how the Facebook API works this week.</p>\n\n<p>Another thing that isn't mentioned is the concept of designing in the browser. While I haven't talked about specific deliverables or techniques needed to complete each phase of the process (e.g. mental models, personas, mobile first design techniques, progressive enhancement, etc.) in-browser design is very much a part of the process but ultimately something that I've not quite figured out yet.</p>\n\n<p>Ultimately, I would like to see web projects designed outside of static mockup tools (such as Photoshop™) so they are built up and thought out in their native environment. Of course, graphics editors will still play an important part in creating the images needed to make a design look fantastic, however, they will not be the start, middle and end of the 'design' phase as they so often are now.</p>\n\n<h2 id=\"whatwebdesignprocessworksforyou\">What web design process works for you?</h2>\n\n<p>This is just my take on what is needed to make a sucessful process for designing and developing websites and it won't suit everyone. What's important is that time has been spent planning and testing a process and tools that make getting from nothing to something efficient and effective.</p>\n\n<p>If you have any tips or techniques (or software recommendations) that are worth checking out then please let me know!</p>\n\n<p>*We like to think that we will review what we've done to make our quoting more accurate, and to some extent this does happen. However, this neglects to acknowledge that each time we complete the process we gain a new insight or do something a slightly different way and on the back of that we quote based on a new idea of how to complete a project. If it were simply the case of repeating the exact same actions over and over again we wouldn't need to quote, a website would simply have a description and a price tag. Technology, our knowledge and users needs are constantly changing and so our estimates look set to remain just that, rough guides.</p>"
    },
    {
      "publishedAt": "2011-10-17T21:30:41.000Z",
      "publishedAtHuman": "3 years ago",
      "publishedAtFormal": "17th October 2011",
      "year": "2011",
      "month": "10",
      "slug": "make-an-animated-search-form-using-only-css",
      "title": "Make an animated search form using only CSS",
      "path": "posts/2011-10-make-an-animated-search-form-using-only-css.html",
      "tags": [
        "Animation",
        "CSS",
        "HTML",
        "Interface",
        "UX"
      ],
      "content": "<p>Inspired by a <a href=\"http://dribbble.com/shots/287760-Search-Interaction-Demo-2\">shot on Dribbble</a> from Morgan Allan Knutson where he showcased an animated search form using only CSS I thought I would try to re-create the effect for myself. Using a bit of CSS3 magic, the effect is actually quite easy to re-create!</p>\n\n<!-- more -->\n\n<h2 id=\"html\">HTML</h2>\n\n<p>The HTML behind this effect is very lightweight:</p>\n\n<pre><code class=\"html    \">&lt;form class=\"search\" action=\"\" method=\"post\"&gt;\n    &lt;label for=\"search-box\"&gt;Search:&lt;/label&gt;\n    &lt;input id=\"search-box\" type=\"text\" name=\"search\"&gt;\n&lt;/form&gt;\n</code></pre>\n\n<p>As you can see there really isn’t anything to the HTML, it’s lean and semantic. I’ve left out the submit button (you can hit Return to submit the form) but for production use I would probably include it to increase the usability of the form.</p>\n\n<p>Breaking down the markup, the form has a class of search, uses the http POST method, submits to itself and has a label and a text field. The label is targeting the text field (to aid with accessibility) and that is it! </p>\n\n<h2 id=\"imageunstyledformelementshttpwwwianthomasnetwpcontentuploads201110screenshot20111017at205018png\"><img src=\"http://www.ian-thomas.net/wp-content/uploads/2011/10/Screen-Shot-2011-10-17-at-20.50.18.png\" alt=\"Image: Unstyled form elements\" title=\"\" /></h2>\n\n<h2 id=\"stylingthelabel\">Styling the label</h2>\n\n<p>So now we have the basic form in place and it's looking pretty ropey! Not to worry though, it won't take long to get this thing looking slick and tidy with a bit of CSS.</p>\n\n<p>Firstly, let's hide the label as it's not really needed for this effect (though I should hasten to mention that all form inputs should have a supporting label element). Instead of setting it to display:none, we'll instead hide it off-screen so that users with Screen Readers or other accessibility needs can see it.</p>\n\n<pre><code class=\"css\">.search label{\n    font-size:0.75em;\n    font-weight:bold;\n    color:#333;\n    text-indent:-9999em;\n    display:block;\n    float:left;\n}\n</code></pre>\n\n<h2 id=\"aquicknoteaboutprogressiveenhancement\">A quick note about progressive enhancement</h2>\n\n<p>It's probably a good time to explain that this effect isn't going to work for all users on all browsers. Rather than it looking like a total abomination we can use the excellent <a href=\"http://www.modernizr.com/\">Modernizr</a> to offer a nicely styled alternative for users without such CSS goodies as border-radius, multiple backgrounds, transitions and gradients. I haven't included a write-up of how to use Modernizr here (and it's not really included in the working demo either) as it's well documented and would probably deserve an article in its own right.</p>\n\n<p>Back to the effect…</p>\n\n<h2 id=\"makingthetextfieldabutton\">Making the text field a button</h2>\n\n<p><img src=\"http://www.ian-thomas.net/wp-content/uploads/2011/10/Screen-Shot-2011-10-17-at-20.58.19.png\" alt=\"Image: An input field styled to look like a button\" title=\"\" />The premise of this effect is that you see a button which, on clicking, turns into an input field so to start we're going to remove all the horrible base styling and make this input field look buttonified. I've chosen to round the corners slightly, add a CSS gradient background to give the appearance of volume, a border and a CSS drop shadow to help enhance the visual effect and the finishing touch is a magnifying glass icon to tell the user that this button relates to search. Phew.</p>\n\n<p>The code looks something like this:</p>\n\n<pre><code class=\"css    \">.search input[type=\"text\"]{\n    text-indent:1px;\n    padding:0 0 0 22px;\n    width:0;\n    height:22px;\n    background:url(http://www.ian-thomas.net/examples/search-icon.png)2px2px no-repeat, -webkit-linear-gradient(top, rgba(100,100,100,1) 0%,rgba(80,80,80,1) 10%,rgba(22,22,22,1)100%);\n    color:#999;\n    line-height:20px;\n    font-weight:bold;\n    -webkit-text-shadow:1px 1px 1pxrgba(0,0,0,0.05);\n    text-shadow:1px 1px 1pxrgba(0,0,0,0.05);\n    -webkit-border-radius:6px;\n    -webkit-box-shadow:1px 1px 0rgba(0,0,0,0.125);\n    cursor:pointer;\n}\n</code></pre>\n\n<p>For the sake of brevity I have only included the webkit specific prefixes but you should include the standard alternatives for Mozilla, Opera and the vendor-less CSS.</p>\n\n<p>The basic shape is created by setting the width to zero and letting the padding give the box some width. This ensures that any text won't be seen and when the input is fully expanded later the cursor will be positioned to the right of the icon. <em>You may also notice that there is a text indent applied, this is because you could just make out 1px of the first character if the input contained some text.</em></p>\n\n<p>The key CSS3 elements are the background, border and box shadow as they create the button look. The background is made up of two parts, my magnifying glass icon (a transparent png) and a linear gradient with three stops. The icon is positioned to centre it in the button and, importantly, is set to not repeat - if we don't then we'll get lots of little icons when we expand the input field later!</p>\n\n<p>To get the shadow etc. looking nice I've chosen to use RGBA colours (which again can be swapped out if the browser doesn't support them using Modernizr) with a lower opacity mimicking the sort of values that I would have typically used in Photoshop.</p>\n\n<p>The border combines with the CSS drop shadow to create a nice embedded effect and the button effect is completed with a slight rounding of the corners. To finish the button effect off, the cursor is set to pointer to give it a real button feel (thanks to <a href=\"http://www.twitter.com/csswizardry\">@csswizardry</a> for pointing that little extra out!)</p>\n\n<h2 id=\"changingtoaninputfield\">Changing to an input field.</h2>\n\n<p>As we want to change the input when it is clicked, we shan't be hooking into the :hover CSS pseudo class and instead will be using :focus. Again, it's probably easier to show the code than explain it so here it is:</p>\n\n<pre><code>.search input[type=\"text\"]:focus{\n    width:200px;\n    outline:none;\n    background:url(http://www.ian-thomas.net/examples/search-icon.png)2px 2px no-repeat, -webkit-linear-gradient(bottom,rgba(100,100,100,1) 0%, rgba(40,40,40,1) 2%, rgba(22,22,22,1)100%);\n    -webkit-box-shadow:1px 1px 0 rgba(255,255,255,0.125);\n    cursor:text;\n}\n</code></pre>\n\n<p>Essentially we are inverting the gradient in the background, changing the box-shadow to a highlight and adding an arbitrary width (this can be set to match your design). The cursor is also changed back to text (as it's now in \"input\" mode) and I've removed the outline (is this naughty?) as I don't like the blue highlight that it gets in Chrome.</p>\n\n<p>With these CSS rules in place your input should look something like this when clicked:</p>\n\n<p><img src=\"http://www.ian-thomas.net/wp-content/uploads/2011/10/Screen-Shot-2011-10-17-at-21.44.27.png\" alt=\"Image: Expanded input field\" title=\"\" /></p>\n\n<h2 id=\"bringingitalltogether\">Bringing it all together</h2>\n\n<p>There's just one thing missing and that's the transitions. As with most of this stuff they are pretty straightforward to implement, with the code looking something like this:</p>\n\n<pre><code>-webkit-transition:width 0.5s ease-in-out;\n</code></pre>\n\n<p>A bit of an anti-climax don't you think? To explain it all fully, I've chosen to animate over half a second (so it feels nice and responsive) and have added easing at the start and end of the transition. The other thing that's important to note is that the transition only affects the width. If we were to set the transition to affect everything we would also see the background and box-shadows animating and the effect would be pretty nasty.</p>\n\n<p>That's it! I hope this has been useful for you, if you want to see the effect in action (and the HTML and CSS that powers it) you can hop over and <a href=\"http://jsfiddle.net/anatomic/XPYWB/\">view it working on jsFiddle</a>.</p>"
    },
    {
      "publishedAt": "2011-07-03T19:13:54.000Z",
      "publishedAtHuman": "3 years ago",
      "publishedAtFormal": "3rd July 2011",
      "year": "2011",
      "month": "07",
      "slug": "tracking-social-engagement-with-google-analytics",
      "title": "Tracking Social Engagement with Google Analytics",
      "path": "posts/2011-07-tracking-social-engagement-with-google-analytics.html",
      "tags": [
        "Facebook",
        "Google Analytics",
        "Javascript",
        "Social Engagement",
        "Social Media",
        "Tracking",
        "Twitter",
        "User Interactions"
      ],
      "content": "<p>Google Analytics has recently introduced Social Interaction Tracking, a way to record and measure user interactions with social media buttons.  While it has been possible to track social interactions using Events, there is now a dedicated section that makes analysing Social actions even easier.  This post shows you how to set up social media tracking for Facebook and Twitter and gives you all you need to go on and set up social interaction tracking on your website.<!-- more --></p>\n\n<h2 id=\"settingupthelatestgoogleanalyticstrackingcode\">Setting up the latest Google Analytics tracking code</h2>\n\n<p>The latest version of Google Analytics has built-in support for tracking +1 button interactions but Facebook and Twitter (and others) need a bit of JavaScript adding to a page to store data.</p>\n\n<p>First, make sure you are using the latest version of the tracking code.  Google Analytics has provided an asynchronous tracking code for a while now so you will more than likely be using it. If you're unsure what that means, in a nutshell it loads the tracking code without stopping the rest of the page downloading (helping to speed up page load) and has a queue of things that should be tracked.  We will use that queue to add social tracking to our page.</p>\n\n<pre><code> var _gaq = _gaq || [];\n_gaq.push(['_setAccount', 'your_code']);\n_gaq.push(['_trackPageview']);\n\n\n\n\n(function() {\n    var ga = document.createElement('script');\n    ga.type = 'text/javascript';\n    ga.async = true;\n    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';\n\n    var s = document.getElementsByTagName('script')[0];\n    s.parentNode.insertBefore(ga, s);\n})();\n</code></pre>\n\n<p>From the code above you can see that the page view is recorded by this line:</p>\n\n<pre><code>_gaq.push(['_trackPageview']);\n</code></pre>\n\n<p>This is the queue that Google Analytics uses to decide what data to send to your analytics account.  To track social actions we will need to change _trackPageview to _trackSocial and offer some extra details, most importantly the social network and action taken.</p>\n\n<p>The code you will need looks like this:</p>\n\n<pre><code>_gaq.push(['_trackSocial', network, action, optional-target, optional-path]);\n</code></pre>\n\n<h2 id=\"trackingfacebookinteractions\">Tracking Facebook Interactions</h2>\n\n<p>Facebook offers a range of social plugins to use on your website and within those plugins there are a range of events that we can hook into and track.</p>\n\n<p>I'll mainly focus on the like and send buttons, but you can also track comments, logins, prompts, status changes and more.</p>\n\n<p>You may need to change your implementation of the plugins slightly, especially if you have used the stock code generated by the examples on the developer pages of Facebook.  Don't worry, I actually think that my method of adding elements is easier as you will only need to load the Facebook script once and can build all XFBML elements in one go.</p>\n\n<p>Using the like button as our example, you first need to make sure that the fb namespace is in your html tag:</p>\n\n<pre><code>xmlns:fb=\"http://www.facebook.com/2008/fbml\"&gt;\n</code></pre>\n\n<p>You also need to make sure that you have an empty element that the Facebook script adds to:</p>\n\n<pre><code>&lt;div id=\"fb-root\"&gt;&lt;/div&gt;\n</code></pre>\n\n<p>Then, simply add the like button to your page (this is typically how I choose to implement the like button, there are other options that you may want to include):</p>\n\n<pre><code>&lt;fb:like href=\"\" send=\"true\" layout=\"button_count\" width=\"150\" show_faces=\"false\"&gt;&lt;/fb:like&gt;\n</code></pre>\n\n<p>If you view your page now, you won't see much as we havent implemented the JavaScript needed to render the like button.  Similarly to the Google Analytics implementation, I prefer to use the asynchronous method of loading the Facebook JavaScript SDK (note that this normally needs to be included underneath the fb-root div in your code):</p>\n\n<pre><code>(function() {\n    var e = document.createElement('script');\n    e.async = true;\n    e.src = (document.location.protocol == 'file:' ? 'http:' : document.location.protocol) +              '//connect.facebook.net/en_US/all.js';\n    document.getElementById('fb-root').appendChild(e);\n}());\n</code></pre>\n\n<p>When loaded, this will look for a function on the overall window object called fbAsyncInit and we use this callback to initialise the XFBML elements (such as the like button) and to set up our social tracking.  I've chosen to track when users like, unlike and send a message:</p>\n\n<pre><code>window.fbAsyncInit = function() {\n    FB.init({xfbml: true});\n    FB.Event.subscribe('edge.create', function(targetUrl){\n        _gaq.push(['_trackSocial', 'facebook', 'like', targetUrl]);\n    });\n    FB.Event.subscribe('edge.remove', function(targetUrl){\n        _gaq.push(['_trackSocial', 'facebook', 'unlike', targetUrl]);\n    });\n    FB.Event.subscribe('message.send', function(targetUrl) {\n        _gaq.push(['_trackSocial', 'facebook', 'send', targetUrl]);\n    });\n};\n</code></pre>\n\n<p>That's it, if you open your page you should now have a like button, a send button, a tracked page view and tracking set up on the like and send buttons.</p>\n\n<h2 id=\"twitter\">Twitter</h2>\n\n<p>Setting up tracking for twitter is very similar, with the only major difference being the way your JavaScript callback needs to  inspect an event for the targetUrl.  For this example I'm going to use the tweet button.</p>\n\n<p>First, include the relevent HTML elements:</p>\n\n<pre><code>&lt;a href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-text=\"Tracking Social Interactions with Google Analytics\" data-count=\"horizontal\" data-via=\"anatomic\"  data-related=\"anatomic:Website designer and developer\"&gt;Tweet&lt;/a&gt;\n</code></pre>\n\n<p>Here you can change the data-text to whatever you want (if it isn't included then Twitter will default to the page's title) and the data-via and data related can also be changed to the accounts of your choice.</p>\n\n<p>Next, we set up the JavaScript that will render the Tweet button and give us the Twitter events:</p>\n\n<pre><code>&lt;script src=\"http://platform.twitter.com/widgets.js\" type=\"text/javascript\"&gt;&lt;/script&gt;\n</code></pre>\n\n<p>Finally, we hook into the tweet event using the following JavaScript:</p>\n\n<pre><code>twttr.events.bind('tweet', function(event) {\n    if (event) {\n        var targetUrl;\n        if (event.target &amp;&amp; event.target.nodeName == 'IFRAME') {\n            targetUrl = extractParamFromUri(event.target.src, 'url');\n        }\n        _gaq.push(['_trackSocial', 'twitter', 'tweet', targetUrl]);\n    }\n});\n</code></pre>\n\n<p>There's just one final element to add, which is the little bit of code to extract the url from the tweet button, it's fairly simple and is shown below:</p>\n\n<pre><code>function extractParamFromUri(uri, paramName){\n    if(!uri){\n        return;\n    }\n    var uri = uri.split('#')[0]; //remove anchor\n    var parts = uri.split('?'); //check for query params\n    if(parts.length == 1){\n        return; //no params\n    }\n\n    var query = decodeURI(parts[1]);\n\n    //find the url param\n    paramName += '=';\n    var params = query.split('&amp;');\n    for(var i = 0, param; param = params[i]; ++i){\n        if(param.indexOf(paramName) === 0){\n            return unescape(param.split('=')[1]);\n        }\n    }\n}\n</code></pre>\n\n<p>As with Facebook, there are more events that you might want to hook into and you can see the full list at <a href=\"http://dev.twitter.com/pages/intents-events\">http://dev.twitter.com/pages/intents-events</a></p>\n\n<h2 id=\"thegoogleanalyticsview\">The Google Analytics view</h2>\n\n<p>Once you have set the tracking up you'll start to see data flowing into your analytics account.  You'll need to be using the 'new version' option in google Analytics where you'll see the social option under the visitors tab.</p>\n\n<p><a href=\"http://www.ian-thomas.net/wp-content/uploads/2011/07/Screen-shot-2011-07-03-at-16.24.41.png\"><img src=\"http://www.ian-thomas.net/wp-content/uploads/2011/07/Screen-shot-2011-07-03-at-16.24.41.png\" alt=\"The social area in Google Analytics\" title=\"\" /></a></p>\n\n<p>From here you can see the percentage of your users that are socially engaged, the actions they take and the pages that they are active on.</p>\n\n<h2 id=\"aquickdemo\">A Quick Demo</h2>\n\n<p>To keep this post to a reasonable length I've not gone into any great detail about other elements that you can track.  With a bit of digging you can find them for yourself but for those in need of a quick fix I've put together a <a href=\"http://www.ian-thomas.net/examples/social-tracking/\">quick demo page</a> that should have everything you need to get social tracking set up for the key plugins from Facebook and Twitter.</p>\n\n<p>The demo includes Facebook like &amp; send buttons, Facebook Comments, Twitter's Tweet button and the Twitter follow button.  <a href=\"http://www.ian-thomas.net/examples/social-tracking/\">Check it out!</a></p>\n\n<p><em>If this post has been useful to you please share it!</em></p>"
    },
    {
      "publishedAt": "2011-06-29T16:00:00.000Z",
      "publishedAtHuman": "3 years ago",
      "publishedAtFormal": "29th June 2011",
      "year": "2011",
      "month": "06",
      "slug": "how-to-quickly-offer-a-preview-of-your-work-using-dropbox",
      "title": "How to quickly offer a preview of your work using Dropbox",
      "path": "posts/2011-06-how-to-quickly-offer-a-preview-of-your-work-using-dropbox.html",
      "tags": [
        "Dropbox",
        "process",
        "Workflow"
      ],
      "content": "<p>Have you ever needed to give a colleague or client a web-based preview of your current project?  Have you found the trudge of setting up some hosting, uploading the files and keeping them up-to-date to be a pain?  I have, and recently I found myself in a position where I had no hosting available so needed to find an alternative way to offer a preview of my work.<!-- more --></p>\n\n<h3 id=\"dropboxmysaviour\">Dropbox my saviour</h3>\n\n<p>I was tipped off by my good friend Nick – <a href=\"http://www.twitter.com/makeusabrew\">http://www.twitter.com/makeusabrew</a> – that Dropbox’s public folder would allow me to get a URL for any files contained within it.  I use Dropbox almost religiously as my work folder so the ability to preview straight from it was brilliant <em>– and I can’t believe I’ve never used this feature before!</em></p>\n\n<p>Rather than copy the files over to the Public folder, I’ve simply used a bit of Terminal magic to set up a symbolic link to the preview files:</p>\n\n<pre><code>ln &lt;span class=\"argument\"&gt;-s&lt;/span&gt; ~&lt;span class=\"other\"&gt;/&lt;/span&gt;Dropbox&lt;span class=\"other\"&gt;/&lt;/span&gt;work&lt;span class=\"other\"&gt;/&lt;/span&gt;project&lt;span class=\"other\"&gt;/&lt;/span&gt;parent_folder&lt;span class=\"other\"&gt;/&lt;/span&gt; ~&lt;span class=\"other\"&gt;/&lt;/span&gt;Dropbox&lt;span class=\"other\"&gt;/&lt;/span&gt;Public&lt;span class=\"other\"&gt;/&lt;/span&gt;preview&lt;span class=\"other\"&gt;/&lt;/span&gt;\n</code></pre>\n\n<p>From there, it’s just a case of right-clicking the newly created preview folder and choosing Dropbox > Browse On Dropbox Website.</p>\n\n<h3 id=\"gettingthepreviewlink\">Getting the preview link</h3>\n\n<p>Once you’re viewing your folder on the Dropbox website, choose the file you want to showcase (in my case it was an index.html) and click ‘Copy public link’ (if you can’t find it, click the down facing arrow on the far right hand side).</p>\n\n<p>You can then either copy the full link or create a shortened version that you can send on to whomever you like.</p>\n\n<p>That’s it! A preview that is always up-to-date and publicly available without the need to set up hosting or ftp files.</p>\n\n<p><em>Just a note, obviously this puts your work on a public URL (although it’s not going to be indexed by google) so be careful about how you share the link if you have commercially sensitive work to preview!</em></p>"
    },
    {
      "publishedAt": "2011-06-22T14:45:00.000Z",
      "publishedAtHuman": "3 years ago",
      "publishedAtFormal": "22nd June 2011",
      "year": "2011",
      "month": "06",
      "slug": "get-people-to-like-your-facebook-page-using-gated-content",
      "title": "Get people to like your Facebook page using gated content",
      "path": "posts/2011-06-get-people-to-like-your-facebook-page-using-gated-content.html",
      "tags": [
        "Facebook",
        "iFrame",
        "Javascript",
        "php"
      ],
      "content": "<p>One of the challenges that faces owners of Facebook Pages is the need to get visitors coming back. It can cost a lot of time, energy and money to get users returning to your page but thankfully Facebook has a feature that can make it easier to stay in touch, the like button.</p>\n\n<p>Getting a user to like your page does two things. Firstly it means that updates from your page (such as your status updates or posting of photos) show up in their newsfeed and, secondly, the news that they like your page is shown across their friends' newsfeeds.</p>\n\n<p>Ideally, we want to get a user to like the page and then have them return regularly to post messages or like updates, repeatedly spreading content from your page to their friends which in turn will hopefully lead to more people clicking the like button.</p>\n\n<p>To make liking the page a more enticing offer it is possible to show non-fans a specific tab when they arrive and within that tab offer some exclusive content if they click the like button. In the past I’ve used this technique to show exclusive videos, give access to competitions or show an interview with a celebrity; the content can be anything, it just needs to be attractive enough to get the user to click the button.<!-- more --></p>\n\n<h2 id=\"theoldway\">The old way</h2>\n\n<p>Previously creating this gated content (or fan gate) was simply a case of installing the static FBML application to your page, creating your content and using a small bit of FBML to say that if the user didn’t like the page then don’t show the content. Simple!</p>\n\n<p>Sadly, this easy implementation was lost when Facebook retired the static FBML application earlier this year.</p>\n\n<h2 id=\"findingoutifauserlikesyou\">Finding out if a user likes you</h2>\n\n<p>Initially on investigating the new iFrame custom tab system it seemed like you would have to request permissions from the user to check through the pages that they have liked. This is a problem as requesting permissions is often a huge barrier to completion and, where possible, I always try to avoid asking.</p>\n\n<p><em>Just as a side note, if you do need to request permissions, make sure you only ask for the bare essentials, users are very picky about accepting when you ask for the moon on a stick, especially if they think you stand to gain more than they will.</em></p>\n\n<p>If your user is viewing your content anywhere other than on your page (i.e. in a Facebook Application or away from Facebook) then you will need to request permissions to check their status. However, when viewing a custom tab we have access to some extra (anonymous) data that tells us exactly what we need to know.</p>\n\n<h2 id=\"thesigned_request\">The signed_request</h2>\n\n<p>If you’re read my previous post about the transition from static FBML to iFrames for custom tabs you’ll have seen that Facebook requests our content via a HTTP POST request. In the POST request is a signed_request value that contains information about the user, including data to say if they are already a fan or not!</p>\n\n<p>The big thing here is that it is anonymous, Facebook is giving us an insight into the user but is not telling us who they are. It’s not as simple as the old FBML way, but it’s better than requesting permissions.</p>\n\n<p>To get to the data you need to process the signed_request, below is some example code that I have used previously to find out the status of a user as a fan.</p>\n\n<pre><code>list($encoded_sig, $payload) = explode('.', $_POST['signed_request'], 2);\n\n$sig = base64_decode(strtr($encoded_sig, '-_', '+/'));\n$data = json_decode(base64_decode(strtr($payload, '-_', '+/')), true);\n\n$expected_sig = hash_hmac('sha256', $payload, $your_application_secret, $raw = true);\nif($sig != $expected_sig){\n    //oops, the signed_request wasn't what it should be so we can't trust it.\n    //need to handle this error gracefully\n}\nelse{\n    //excellent, the data is valid\n    //now check to see if the user is a fan\n    if($data['page']['liked']){\n        //great, the user likes the page\n        //show the extra content\n    }\n    else{\n        //not a fan yet\n        //let's dangle the carrot that makes them click like\n    }\n}\n</code></pre>\n\n<h2 id=\"whathappenswhensomeoneclickslike\">What happens when someone clicks like</h2>\n\n<p>Depending on how you have decided to allow users to like your page there are a couple of different ways to check their fan status.</p>\n\n<ol>\n<li><p>If a user clicks the main like button at the top of your page, the page will automatically refresh on your application and your code should have seen the change in their fan status through the signed_request and show content accordingly.</p></li>\n<li><p>If, however, you have implemented a second like button, typically with xfbml and the Javascript SDK, you will need to create a Javascript function that listens for the edge_create event. When this event is triggered you can either use Javascript to reveal the content or, as I have done in the past, you can cause the browser to reload the page in a similar fashion to clicking the main like button at the top of the page.</p></li>\n</ol>\n\n<p>The code to subscribe to the clicking of a like button to become a fan is as follows:</p>\n\n<pre><code>FB.Event.subscribe('edge.create', function(){\n    self.parent.location.href='url_to_show';\n});\n</code></pre>\n\n<h2 id=\"inconclusion\">In conclusion</h2>\n\n<p>There you have it, a quick overview of how to use the data presented by Facebook’s signed_request to see whether a user is a fan or not. As with anything on the net, it is important to consider the intentions of users and try to produce content and interactions that match their motivations. If you have great content that you need people to share, something like a fan gate can be a great way to get your content shared across Facebook.</p>\n\n<p><em>If you liked this post please share it!</em></p>"
    },
    {
      "publishedAt": "2011-03-11T15:05:00.000Z",
      "publishedAtHuman": "3 years ago",
      "publishedAtFormal": "11th March 2011",
      "year": "2011",
      "month": "03",
      "slug": "goodbye-static-fbml-hello-iframe-an-overview-of-custom-tabs-for-facebook-pages",
      "title": "Goodbye Static FBML, Hello iFrame - An Overview of Custom Tabs for Facebook Pages",
      "path": "posts/2011-03-goodbye-static-fbml-hello-iframe-an-overview-of-custom-tabs-for-facebook-pages.html",
      "tags": [
        "custom apps",
        "Facebook",
        "iFrame"
      ],
      "content": "<p>Facebook has recently upgraded Pages with a raft of new features that are aimed at helping Page owners communicate more effectively.  Amongst the new features are better ways to keep up with activity on a Page, new ways for Pages to share content, new ways for users to filter a Page's content by relevancy and a completely new system for creating Custom Tabs.</p>\n\n<p>I've been looking into what these updates mean for businesses and app designers and have found that the new iFrame system opens the door to bigger and better Custom Tabs.<!-- more --></p>\n\n<p><strong>The New Custom Page</strong></p>\n\n<p>The most obvious change has been the design, with tabs being removed from the top to under the profile image and photos uploaded to the Page being displayed across the top in the same way as a normal Facebook Profile.  Additionally, it is now possible for admins to browse Facebook as a Page, increasing the ability for the Page to build a presence through liking, commenting and sharing content across the network.</p>\n\n<p>The not so obvious change is in the way that Custom Tabs can be added.  Previously it was possible for a user to create a Tab using the Static FBML application and this was a really simple way to get a personalised tab that could act as the opening view of your Page.  FBML offered ways to access features of Facebook, including the like button and comments, as well as ways to use data about the user to customise content for them.  A fan gate was a typical feature where different content was shown to users who had liked a Page to those who hadn't.</p>\n\n<p>I'm talking about FBML in the past tense because that functionality has all changed, and from tomorrow (12th March 2011) you are no longer able to add a Static FBML tab to your Page.  Instead, Facebook has introduced iFrame support to Pages and Custom Tabs can only be created using that feature.</p>\n\n<p><strong>How to add a Custom Tab</strong></p>\n\n<p>So how do you go about building a Custom Tab using iFrame Applications?  The good news is that the new system is actually much better in terms of functionality that can be provided and once familiar with the process it is really simple.</p>\n\n<p>A Custom Tab is setup in the <a href=\"http://developers.facebook.com\">developers area of Facebook</a> in the same way that applications are created.  You specify a base url for your Canvas Application and then specify the url that tab content should come from.  Currently you have to specify a Canvas URL, even if you only want to use the Custom Tab feature.</p>\n\n<p>Development and testing is easier as you can build your application locally and use exactly the same code to power the live application, no need to copy and paste FBML/HTML into a form on Facebook before clicking to preview.  An extra little benefit is that because you host the content, not Facebook, the aggressive caching that Facebook employed for Static FBML tabs is now no longer used, so no more having to put query strings on css and image urls when you need to make a change!</p>\n\n<p>With the Javascript SDK and various server-side SDKs (typically I use the PHP SDK to access features of the Graph API) it is now possible to build your application using the same HTML, CSS and Javascript that you use on your own website.  This means that libraries such as jQuery and MooTools can be used to provide extra functionality to your custom Tab.</p>\n\n<p><strong>iFrame Apps Technical Details</strong></p>\n\n<p>Facebook sends POST data to your application when a user clicks to view your Custom Tab (they call this the Signed Request).  Depending on where your application is being viewed, the Signed Request includes information about the Page and the User.  If you haven't requested extra permissions, there is only limited data about the User available, including their country, locale and ID.</p>\n\n<p>For Custom Tabs the signed request contains extra information about the Page, including a boolean that says whether a user has liked the page or not.  This feature is what allows fan gates to be implemented as it provides a way to check a user's status without having to request advanced permissions.  You can also detect whether the user is an admin of the page.</p>\n\n<p>The migration from FBML to iFrame tabs has also meant the demise of preload FQL.  As with currently built static FBML tabs, any apps that make use of preload FQL currently will continue to work, but new apps will not be able to use this functionality.</p>\n\n<p><strong>Custom Tab Gotchas</strong></p>\n\n<p>The need to implement Custom Tabs through iFrame apps has also introduced some interesting gotchas that application developers and Page admins need to take into consideration.  The main one being that all applications, even when not submitted to the Application Directory, have a publicly available profile page.  Whether this profile page is advertised or not there are ways to find it, and trust me that users will, so updates and administration will need to be factored into the management of the Custom Tab.</p>\n\n<p>Another potential source of issues is that a Canvas Application will exist for all Custom Tabs.  What content, if any, is shown there is a point for discussion between developers, designers and the Page admins, however it is worth remembering that a Canvas Application doesn't get the extra Page data in its signed request, so any Page specific functionality needs to be removed.</p>\n\n<p>Finally, it is worth remembering that apps can be installed on any Page, not just the ones that you administer, so it is important to plan what should happen if the app is installed away from your control.  Typically I suggest using that installation as an advert that directs users back to the Page for which the Custom Tab was created, but that certainly isn't the only way to handle that situation.</p>\n\n<p><strong>Expanding Your App</strong></p>\n\n<p>This move by Facebook to remove Static FBML apps will inevitably lead to developers and businesses becoming more aware of the Graph API and the structure of applications both on and off Facebook as opposed to simply knowing how to have a custom design installed on their Page.  I also think it will help Facebook spread the usage of the Open Graph as businesses will now have applications that they can use to administer their Open Graph pages.</p>\n\n<p>With the iFrame content being served from 3rd party servers it is possible to build Facebook support into a central CMS.  This could open the door to much greater control and use of Facebook Pages as content can be managed and updated a lot more easily than was previously possible using Static FBML. Showcasing a particular product on your Page could now be as simple as changing an image and some text in your CMS.</p>\n\n<p>Of course, this is merely scratching the surface of what is possible, and I'm sure that in the coming months we shall see a wave of innovative uses of iFrame applications that weren't previously possible using the Static FBML app. On the flip-side, there will be people that don't want to move to the new iFrame system and apps are already popping up that replicate the functionality that was offered by Static FBML.</p>\n\n<p><strong>More Information</strong></p>\n\n<p>Extra details about the changes to Pages and the migration from Static FBML to iFrame apps can be found on Facebook:</p>\n\n<ul>\n<li><p><a href=\"http://developers.facebook.com/blog/post/462\">http://developers.facebook.com/blog/post/462</a></p></li>\n<li><p><a href=\"http://developers.facebook.com/blog/post/477\">http://developers.facebook.com/blog/post/477</a></p></li>\n<li><p><a href=\"http://developers.facebook.com/docs/authentication/signed_request/\">http://developers.facebook.com/docs/authentication/signed_request/</a></p></li>\n<li><p><a href=\"http://www.facebook.com/notes/facebook-pages/an-upgrade-for-pages/10150090729064822\">http://www.facebook.com/notes/facebook-pages/an-upgrade-for-pages/10150090729...</a></p></li>\n</ul>"
    },
    {
      "publishedAt": "2011-02-26T11:51:00.000Z",
      "publishedAtHuman": "3 years ago",
      "publishedAtFormal": "26th February 2011",
      "year": "2011",
      "month": "02",
      "slug": "facebook-announces-more-ways-to-publish-to-users-who-click-like-buttons",
      "title": "Facebook Announces More Ways to Publish to Users Who Click Like Buttons",
      "path": "posts/2011-02-facebook-announces-more-ways-to-publish-to-users-who-click-like-buttons.html",
      "content": "<blockquote>\n  <p>Millions of websites and social games have implemented Facebook’s Like button social plugin, yet relatively few are taking advantage of the capability to publish news feed stories to users that click those buttons. In an effort to increase awareness of this option, Facebook <a href=\"http://developers.facebook.com/blog/post/465\">posted to the Developers Blog</a> explaining three ways admins can publish to their Like buttons, including through the new “Use Facebook as Page” feature.</p>\n</blockquote>\n\n<p>via <a href=\"http://www.insidefacebook.com/2011/02/23/how-publish-like-button/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+InsideFacebook+%28Inside+Facebook%29\">insidefacebook.com</a></p>"
    },
    {
      "publishedAt": "2011-02-02T14:42:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "2nd February 2011",
      "year": "2011",
      "month": "02",
      "slug": "design-utilities-wireframing-template",
      "title": "Design Utilities - Wireframing Template ",
      "path": "posts/2011-02-design-utilities-wireframing-template.html",
      "tags": [
        "Design",
        "process",
        "templates",
        "wireframes"
      ],
      "content": "<p>A key step in my design process is getting ideas down on paper.  It doesn't really matter where this happens, either in my lovely notebook or on sheets of A4, the key is to rapidly get ideas sketched out using good old pencil and paper.</p>\n\n<p>One recent addition to my wireframing toolkit was a <a href=\"http://www.fujitsu.com/us/services/computing/peripherals/scanners/scansnap/scansnap-s1500m.html\">Fujitsu Scansnap S1500m</a> - a great document scanner that does double sided scans very, very quickly.  I've combined this with <a href=\"http://www.evernote.com\">Evernote</a> to get cloud based, text searchable documents that I can organise really easily.</p>\n\n<p><a href=\"http://www.ian-thomas.net/wp-content/uploads/2011/02/Wireframing-revised-homepage.jpg\"><img src=\"http://www.ian-thomas.net/wp-content/uploads/2011/02/Wireframing-revised-homepage-300x225.jpg\" alt=\"Example of my wireframing template\" title=\"\" /></a></p>\n\n<p>In addition to Evernote and the Scansnap, I've created a custom template that I find is great for creating slightly tighter, hand-drawn wireframes.</p>\n\n<p>We've been using this template in the office on all our recent work, with the resulting wireframes getting pinned up on the walls for review, scanned into Evernote for indexing and storage and included in documents that are shared with clients.</p>\n\n<p>The template is light grey dot grid which I find is really good for guiding straight lines without getting in the way (as a more traditional squared paper may).</p>\n\n<p>I don't know if people will find it useful but I'll share it anyway, happy days!</p>\n\n<p><a href=\"http://posterous.com/getfile/files.posterous.com/temp-2011-02-02/lECrAcGujctrvpGxbCzFBqoetlzhotEcFaAytIIfbGjrwvIcIxqfnosDqdAG/Wireframe_Templates.pdf\">Download the template file</a></p>"
    },
    {
      "publishedAt": "2011-01-29T14:57:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "29th January 2011",
      "year": "2011",
      "month": "01",
      "slug": "notebook-thoughts-a-better-way-of-making-contact",
      "title": "Notebook thoughts - A better way of making contact",
      "path": "posts/2011-01-notebook-thoughts-a-better-way-of-making-contact.html",
      "tags": [
        "user experience",
        "web design"
      ],
      "content": "<p>As part of an upcoming pitch I have been working away from my computer to remove internet distractions and open myself up to more creative thinking.</p>\n\n<p>So, armed with a trusty pencil and a lovely Moleskine Cahier gridded notebook I've been perched in the front atrium of the Round Foundry Media Centre jotting down my thoughts and ideas for this exciting web project.</p>\n\n<p>Some of the notes I've made are project specific, but some of them are more widely applicable and I thought they could be of interest/use to others so here is the first in a series of posts explaining some of my thoughts.</p>\n\n<h2 id=\"mailtoisdead\">Mailto: is dead</h2>\n\n<p>As part of this pitch we commissioned some remote user testing (courtesy of the great service <a href=\"http://www.whatusersdo.com\">www.whatusersdo.com</a>) and one of the unsuspected findings was how people want to contact others when browsing the web.</p>\n\n<p>The problem was this, a user saw that they needed to email someone for more information, they clicked the email address and boom, their computer went crazy!  All sorts of alerts and popups from Windows Live Mail, confusion reigned and they were left struggling to work out what to do next.  If emailing the person shown on the site was a goal, this user was certainly struggling to achieve it.</p>\n\n<p>The problem here is that there is a huge group of users on the internet that don't use a native mail client.  Instead, services such as Yahoo, Hotmail and Gmail are the preferred choices and often people don't setup these accounts with traditional mail clients like Thunderbird, Outlook Express or Mac Mail.</p>\n\n<p>My notes on this were simply the following:</p>\n\n<blockquote>\n  <p>People should be able to communicate with a site's contact without having to use their email or 3rd party software.</p>\n</blockquote>\n\n<p>In short, if there is any part of your site that lists someone's email address as a means of contact consider implementing a neat way to show them a contact form with the recipient clearly shown.  The user won't have to leave the site, open a new window or get confused by popups telling them they have to set up their mail accounts.</p>"
    },
    {
      "publishedAt": "2010-09-02T12:08:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "2nd September 2010",
      "year": "2010",
      "month": "09",
      "slug": "think-vitamin-%c2%bb-20-steps-to-better-wireframing",
      "title": "Think Vitamin » 20 Steps to Better Wireframing",
      "path": "posts/2010-09-think-vitamin-%c2%bb-20-steps-to-better-wireframing.html",
      "content": "<blockquote>\n  <p><strong>17) It’s Not Just the Public Site</strong>  </p>\n</blockquote>\n\n<p>Many sites have an administration area for managing content, viewing registered user profiles, resetting passwords etc. This may not be viewed by many people but it is still important. Sometimes it can contain data that is not publicly available (such as a user account enable button). This is important information to developers when designing the database.</p>\n\n<p>via <a href=\"http://thinkvitamin.com/web-apps/20-steps-to-better-wireframing/\">thinkvitamin.com</a></p>\n\n<p>Something that I know often gets left to the last minute but the admin side is so important for client satisfaction.</p>"
    },
    {
      "publishedAt": "2010-07-22T17:10:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "22nd July 2010",
      "year": "2010",
      "month": "07",
      "slug": "particle-swarm-experiment-3",
      "title": "Particle Swarm Experiment 3",
      "path": "posts/2010-07-particle-swarm-experiment-3.html",
      "tags": [
        "Actionscript",
        "AS3",
        "Flash",
        "HYPE",
        "Particles"
      ],
      "content": "<p>The little experiment now has multiple modes and a little system for sequencing them. I think this might be as far as I take this for now, but may end up coming back to it to add some new bits and pieces.</p>\n\n<p><!-- more --><a href=\"http://posterous.com/getfile/files.posterous.com/anatomic/LyBGCMFZQUALuE2zuxiKeXWob0V1QqDSpnO8goPk7yZvBYFCHd0zqtQOngyc/ParticleSwarm3.swf\">Particle Swarm 3</a></p>\n\n<p>The code is pretty straightforward and development was made even quicker thanks to the awesome HYPE framework.  I wrote a custom particle class that is solely used to store numbers and calculate where it should go next (you pass it a target point and it swarms towards it) and the Main class generates and animates the 40 0000+ particles.</p>\n\n<p>The Object Pool class from the HYPE Framework made working with large numbers of particles easy, though I think I could probably get greater performance from a custom solution.  Other than the maths to work out where a particle should go next the only other code worth noting is how a particle is drawn.</p>\n\n<p>Experienced flash developers will know this like the back of their hands, but it's useful to document for newer developers that might now have had the exposure to manipulating large numbers of particles and drawing them to the screen.  It involves a large bitmap and the BitmapData class' setPixel32() method.</p>\n\n<pre><code>bmd.colorTransform(bmd.rect, new ColorTransform(1,1,1.02,0.99));\nbmd.applyFilter(bmd, bmd.rect, new Point(0,0), new BlurFilter(1.15, 1.15, 1));\nbmd.lock();\npool.activeSet.forEach(function(p:Pixel):void{\np.update();\nbmd.setPixel32(p.x, p.y , p.color);\n});\nbmd.unlock()\n</code></pre>"
    },
    {
      "publishedAt": "2010-07-21T12:10:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "21st July 2010",
      "year": "2010",
      "month": "07",
      "slug": "particle-swarm-experiment-part-2",
      "title": "Particle Swarm Experiment part 2",
      "path": "posts/2010-07-particle-swarm-experiment-part-2.html",
      "tags": [
        "Actionscript",
        "AS3",
        "Flash",
        "Particles"
      ],
      "content": "<p>I'm starting to pull the particles experiment into some form of shape now so it's possible to visualise the underlying shape a bit better. I've also tightened up the colour scheme a little bit rather than just using random values.</p>\n\n<!-- more -->\n\n<p><a href=\"http://www.ian-thomas.net/particle-swarm-experiment-part-2\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/07/unknown.png?w=48\" alt=\"\" title=\"\" /></a></p>\n\n<p><strong>Main.swf</strong>\n<a href=\"http://posterous.com/getfile/files.posterous.com/anatomic/77Pr1VSTqmnraip7k5olbUpvYJbN3fL2VhDa5p7SrSOOXSzuWKPHhDz1aDxO/Main.swf\">Download this file</a></p>\n\n<p>I think the next step for this system is to introduce a way of stepping through various sequences of patterns, I've got a good idea how this might be achieved so keep checking back to see what might come of it!</p>"
    },
    {
      "publishedAt": "2010-07-20T22:19:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "20th July 2010",
      "year": "2010",
      "month": "07",
      "slug": "a-happy-accident",
      "title": "A happy accident",
      "path": "posts/2010-07-a-happy-accident.html",
      "tags": [
        "Actionscript",
        "AS3",
        "Flash",
        "HYPE",
        "Particles"
      ],
      "content": "<p>Whilst playing with extending the HYPE framework I stumbled across this happy accident. It's not really what I'd intended the piece to do, but I think it looks really cool anyway.<!-- more --></p>\n\n<p><a href=\"http://www.ian-thomas.net/a-happy-accident-0\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/07/unknown.png?w=48\" alt=\"\" title=\"\" /></a></p>\n\n<p><strong>Main.swf</strong>\n<a href=\"http://posterous.com/getfile/files.posterous.com/anatomic/wQYKnbiXYVVTWmdJ5qQrqxdzeqKhC89fgktP1pcAHygBMyQrsdDKI2o382hU/Main.swf\">Download this file</a></p>\n\n<p>I'm using the ObjectPool along with some customised swarm code to move 50000 pixel particles around the screen. Not that you can tell from this, but there is an underlying shape from which each particle gets a target point. Each particle is drawn to a bitmap which has a slight colorTransform applied to give the fade and colourise effect. </p>\n\n<p>Currently the particles are given a randomly generated colour, but this will be extended to use custom colours. The next step, however, will be to use multiple bitmaps and apply funky blend modes, check back later for a bit more of that! </p>\n\n<p>This example was coded in the brilliant FDT 4 M3 (I really recommend people get hold of this if they haven't already) and Flash Pro CS5. I'm becoming firmly convinced that this setup is the best Flash/Actionscript workflow you can have (probably another post about that though!).</p>"
    },
    {
      "publishedAt": "2010-06-15T13:49:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "15th June 2010",
      "year": "2010",
      "month": "06",
      "slug": "40-000-particles-with-a-perlin-flow-field-using-actionscript",
      "title": "40 000 Particles with a Perlin Flow Field using Actionscript",
      "path": "posts/2010-06-40-000-particles-with-a-perlin-flow-field-using-actionscript.html",
      "tags": [
        "Actionscript",
        "Animation",
        "AS3",
        "Generative",
        "Particles"
      ],
      "content": "<p>Sounds really exciting doesn't it but what you see below you is the result of little experiment to see how many particles my computer could handle at a decent frame-rate. I got up to 75 000 before it started to chug but for the sake of demonstration the following example only has 40 000 so that the majority of people can have a decent viewing experience.</p>\n\n<!-- more -->\n\n<p><a href=\"http://www.ian-thomas.net/40-000-particles-with-a-perlin-flow-field-usi\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/unknown.png?w=48\" alt=\"\" title=\"\" /></a></p>\n\n<p><strong>Particle Storm C.swf</strong>\n<a href=\"http://posterous.com/getfile/files.posterous.com/anatomic/PaEtZC3atl6J6zJLOpQj9WnKWnr5maAsB0wqzVj2eOsS8Q6LHEkGJA3OSUDq/Particle_Storm_C.swf\">Download this file</a></p>\n\n<p>Although coded by myself, the idea takes inspiration from an example on the great site <a href=\"http://www.flashandmath.com\">www.flashandmath.com</a> - Perlin Noise Accelerated Particles (<a href=\"http://www.flashandmath.com/flashcs4/storm/index.html\">http://www.flashandmath.com/flashcs4/storm/index.html)</a>)</p>\n\n<p>I'll post up some of my code later once I've given it a tidy up.</p>"
    },
    {
      "publishedAt": "2010-06-02T15:30:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "2nd June 2010",
      "year": "2010",
      "month": "06",
      "slug": "how-i-made-the-artwork-for-supatronix-using-flash-as3-and-the-hype-framework",
      "title": "How I made the artwork for Supatronix using Flash, AS3 and the HYPE Framework",
      "path": "posts/2010-06-how-i-made-the-artwork-for-supatronix-using-flash-as3-and-the-hype-framework.html",
      "tags": [
        "actionscript 3",
        "Art From Code",
        "Flash",
        "generative art",
        "HYPE",
        "supatronix"
      ],
      "content": "<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_19.png?w=212\" alt=\"7-on-black_19\" title=\"\" /></p>\n\n<p>Supatronix celebrated 7 years of broken beats and bass this year and for their birthday artwork they wanted something a little bit special. The brief was for a pixelated number 7 and with my recent interest in generative art I thought it was the perfect chance to get my hands dirty and produce some artwork.  I chose to use the HYPE framework for most of the job as I knew that the BitmapCanvas class would allow me to capture the image at a high enough resolution for print.</p>\n\n<p>Version 1</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_4_crop.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_4_crop.png?w=300\" alt=\"7-on-black<em>4</em>crop\" title=\"\" /></a></p>\n\n<p>The idea I had for the art was to set a number of squares randomly vibrating and allow them to move about the canvas area. Colours were sampled from an image that I'd made in Photoshop of a slightly pixelated number 7. The colours were updated roughly every half a second to allow the colours to bleed out from the original shape.  This produced some really nice, highly detailed images but it was felt that the number was getting lost in the overall design so I started to look into other ways of bumping up the definition of the main shape.</p>\n\n<p>Version 2</p>\n\n<p>My first update was to set several boids swarming to different points within the target shape with colours being pulled from a the colour pool I'd set up using HYPE. To me this looked absolutely ace, but was far too abstract so another angle was needed!</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_6_crop.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_6_crop.png?w=300\" alt=\"7-on-black<em>6</em>crop\" title=\"\" /></a></p>\n\n<p>Version 3</p>\n\n<p>The colours struck a chord with the client though so I had made a step in the right direction there. My final tweak was to change the swarm to random placement of squares. The squares wouldn't leave the abstract trails of the swarm, but could be given the bright colours to help the main shape stand out. This worked really nicely and created the exact effect that I was after. Several variations and sizes followed before the final design was signed off.</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_19_crop.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_19_crop.png?w=300\" alt=\"7-on-black<em>19</em>crop\" title=\"\" /></a></p>\n\n<p>Producing the artwork was a great learning experience and I'm glad to say that the end product has been really well received. I've had several requests for high resolution versions and the next set of images for Supatronix are all going to be using a very similar style!</p>\n\n<p>Gallery of designs from throughout the process</p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_4.png?w=212\" alt=\"7-on-black<em>4\" title=\"\" />\n<img src=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_14.png?w=212\" alt=\"7-on-black</em>14\" title=\"\" />\n<img src=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_6.png?w=212\" alt=\"7-on-black<em>6\" title=\"\" />\n<img src=\"http://ianthomasnet.files.wordpress.com/2010/06/7-on-black_21.png?w=212\" alt=\"7-on-black</em>21\" title=\"\" />\n<img src=\"http://ianthomasnet.files.wordpress.com/2010/06/07-on-black_19.png?w=212\" alt=\"07-on-black_19\" title=\"\" /></p>\n\n<p><a href=\"http://www.ian-thomas.net/how-i-made-the-artwork-for-supertronix-using\">See the full gallery on Posterous</a></p>"
    },
    {
      "publishedAt": "2010-05-26T14:56:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "26th May 2010",
      "year": "2010",
      "month": "05",
      "slug": "big-swooping-circle-things",
      "title": "Big swooping circle things!!",
      "path": "posts/2010-05-big-swooping-circle-things.html",
      "tags": [
        "actionscript 3",
        "Art From Code",
        "Flash",
        "generative art",
        "HYPE",
        "Particles"
      ],
      "content": "<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/05/dark_circles_5-png-scaled-1000.jpg\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/05/dark_circles_5-png-scaled-1000.jpg?w=300\" alt=\"Dark<em>circles</em>5\" title=\"\" /></a></p>\n\n<!-- more -->\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/05/dark-circles-5-crop-1-scaled1000.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/05/dark-circles-5-crop-1-scaled1000.png?w=300\" alt=\"Dark-circles-5-crop-1\" title=\"\" /></a></p>\n\n<p>After playing some more with a particle engine I'd written, I started to wonder what would happen if I drew using the particles as anchor points.  This is the result, a massive abstract mess!!</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/05/dark-circles-5-crop-2-scaled1000.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/05/dark-circles-5-crop-2-scaled1000.png?w=300\" alt=\"Dark-circles-5-crop-2\" title=\"\" /></a></p>\n\n<p>Getting closer in to the image reveals a level of detail that I find really fascinating.  The particles were spewed from an emitter and the Flash Graphics API was used to draw the circular shapes.  There was a BitmapCanvas from the HYPE framework capturing what was going on once every second and the colours were selected using the HYPE ColorPool.  Additional movement and randomness was added by using the Swarm and RandomTrigger classes.</p>\n\n<p>The image was exported to PNG and because of the superb large canvas features included in BitmapCanvas the resulting file size is not only massive but crystal clear for high dpi, large format print runs.</p>\n\n<p>This was really just a test run and isn't that great as a piece of art (in my eyes) so now I'm going to take this and build on it to produce some limited edition prints.  The theme I have in mind revolves around peoples' names and if it works will hopefully produce some absolutely stunning pieces of art.  I hope!!</p>"
    },
    {
      "publishedAt": "2010-05-17T17:44:55.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "17th May 2010",
      "year": "2010",
      "month": "05",
      "slug": "some-special-artwork-produced-using-flash-as3-and-the-hype-framework",
      "title": "Some special artwork produced using Flash, AS3 and the HYPE framework",
      "path": "posts/2010-05-some-special-artwork-produced-using-flash-as3-and-the-hype-framework.html",
      "tags": [
        "Actionscript",
        "Art From Code",
        "AS3",
        "Flash",
        "generative art",
        "HYPE"
      ],
      "content": "<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/05/anniversary-composition-print-scaled-1000.jpg\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/05/anniversary-composition-print-scaled-1000.jpg?w=300\" alt=\"Anniversary-composition-print-\" title=\"\" /></a></p>\n\n<p>Above is some artwork that I've been creating using Flash, AS3 and the HYPE Framework (<a href=\"http://www.hypeframework.com\">www.hypeframework.com</a>). It's a one-off piece and it's the first print I will have ever had professionally printed. Fingers crossed that it comes out looking great! </p>\n\n<p>Although I've been a bit quiet recently on the generative art front, I've been secretly beavering away creating some different bits and pieces both as paid client work and for personal satisfaction. One of the big breakthroughs for me was finding the HYPE framework and utilising the excellent BitmapCanvas and ContextSavePNG classes to produce hi-res copies of my artwork. Hats off to Joshua Davis and Branden Hall for an excellent framework that is so easy to use and extend! </p>\n\n<p>I've got some more cool artwork to post up in the next week or so that was used for a promotional flyer for London based Breaks night Supatronix. I'll cover how it was made and will probably release the code as well so people can have a play about and create their own versions! </p>\n\n<p>I can't show the whole of this artwork just yet, but will definitely be posting it up in due course - the lucky recipient needs to get their hands on it first though!</p>"
    },
    {
      "publishedAt": "2010-04-27T18:15:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "27th April 2010",
      "year": "2010",
      "month": "04",
      "slug": "should-digital-designers-learn-to-love-coding",
      "title": "Should digital designers learn to love coding?",
      "path": "posts/2010-04-should-digital-designers-learn-to-love-coding.html",
      "tags": [
        "Code",
        "Design",
        "Digital",
        "Web"
      ],
      "content": "<p>My job title at <a href=\"http://www.coolpink.net/\">Coolpink</a> is 'Web Designer' and though my role has developed over time to incorporate Flash design and development, it was initially a bit different to what I'd come to expect as a web designer - I didn't have to code any HTML or CSS!  This came as a bit of a surprise to me (though not one that I would describe as unpleasant) and my colleagues all seemed happy enough with this arrangement.</p>\n\n<p>It quickly became apparent that none of the design team had aspirations to learn Actionscript either so the Flash output was mainly slightly amended stock elements or very straight forward animations using the timeline and snippits of code pinched from searches on Google.</p>\n\n<p>My background in Computer Science gave me a fairly hefty leg up when I stepped in to take charge of the Flash work we had coming in.  The recent release (at that time) of AS 3.0 meant that much of the best-practise for coding ActionScript fit with theory already in my head and as I worked on more interactive projects it became apparent that the best quality work could only be achieved by implementing code, not purely using the timeline in isolation.</p>\n\n<p>In the past six months my role has changed as I've begun to focus more  on creating experiences and interactive work and less on standard web design, so much so that I'd consider my job title to have changed from Web Designer to Interactive Designer.  I'll be quick to state that interactive does not equal animation (or the inherently bland images fading between one another as part of a promo), everything that someone comes into contact with on the Internet is in some way interactive.  On the whole though, I've been responsible for designing  and developing Flash games/sites/widgets/etc. that are based around  reacting to a user's input.</p>\n\n<!-- more -->\n\n<p>So, should digital designers learn to love coding? I'd say a definite yes as you can explore the digital medium better by knowing how to code, you are not limited to static mock ups of ideas.  One of the things I love about working with Flash is that you can create visually stunning work that can only be achieved by coding.  I'd argue that a coder that didn't have a visual flair wouldn't be able to produce this sort of work in the same way that a designer that creates beautiful work couldn't.  You only have to look at work by <a href=\"http://www.joshuadavis.com\">Josua Davis</a>, <a href=\"http://www.eriknatzke.com\">Erik Natzke</a>, <a href=\"http://www.quasimondo.com\">Quasimondo</a>, <a href=\"http://www.levitated.net\">Jared Tarbell</a>, <a href=\"http://www.bit-101.com\">Bit101</a>, etc. etc. to see what I'm talking about.  Beautiful work all achieved through coding.</p>\n\n<p>Sometimes the code is solely responsible for making something react or change in a pretty way, sometimes it changes a set of rules by which the elements on the screen abide, sometimes it uses drawing commands to produce artwork that mimics reality and sometimes it simpley loads another web page.  All of this code is creative and as a designer I feel better equipped to produce outstanding work by having the ability to make my ideas a reality, better equipped to make the user's experience of my work breathtaking.</p>\n\n<p>Of course, not everyone loves Flash but that doesn't mean to say that code is meaningless to you if you don't create Flash work.  Javascript is a massive part of any website and is fundamental in improving users' experiences on the web as a whole.  Facebook without Javascript (in fact a lot of sites without AJAX) would be a horrific experience!  For the 'Flash is dead' brigade, HTML5 and specifically the Canvas tag will definitely not do away with a need to code, quite the opposite as there is currently no visual IDE available for production of content.</p>\n\n<p>Reading, understanding and talking about what is possible with regards to digital is one thing; but I believe that only by understanding and implementing code will you truly get the best result.*</p>\n\n<p>There is, of course, the opposing viewpoint that designers should stay away from code to avoid limiting creativity.  Lukas Mathis is <a href=\"http://ignorethecode.net/blog/2009/03/10/designers-are-not-programmers/\">strongly against designers coding</a> saying:</p>\n\n<blockquote>\n  <p>Designers who also know how to code either work with dedicated  programmers, or they implement their own designs. Both cases can cause  issues.</p>\n  \n  <p>In the first case, the user interaction designer is compromised  because he may make premature decisions which should be left up to the  programmer, who has the full picture of the code base and better  knowledge of the technology. In the second case, he is compromised  because he has two contradicting goals.</p>\n</blockquote>\n\n<p>I disagree with this viewpoint as it relates more to the ability and mindset of the designer.  A good designer should implement good processes to ensure that they focus on the correct part of the job in hand and shouldn't limit themselves when thinking of how to creatively solve a brief.</p>\n\n<p>Any designer's focus should always be on producing the best possible user experience and when it comes to working in the digital medium I'd say that a decent grasp of the relevant code is increasingly important.</p>\n\n<p><em>*My caveat here is that coded projects are inevitably best when completed in tadem with an experienced developer.  I guess the main point should be that as a designer with the ability to code, it is possible to get the idea working in some form or another and then you can go to a developer and really make it sparkle.</em></p>"
    },
    {
      "publishedAt": "2010-04-15T22:59:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "15th April 2010",
      "year": "2010",
      "month": "04",
      "slug": "what-does-apple-vs-adobe-mean-for-new-professional-flash-designers-and-developers",
      "title": "What does Apple Vs. Adobe mean for new professional Flash designers and developers?",
      "path": "posts/2010-04-what-does-apple-vs-adobe-mean-for-new-professional-flash-designers-and-developers.html",
      "tags": [
        "Adobe",
        "Apple",
        "Flash"
      ],
      "content": "<p>The iPhone started it, the iPad carried it on and now it seems that the revised T's &amp; C's from Apple have really fired the whole Apple vs. Adobe argument. From the outset I'm going to put my cards on the table, I love Apple products - I have an iPhone, an iMac and use Apple computers at work - and I also love working with Flash so this situation is one that is of both interest and concern to me. </p>\n\n<p>My personal history in this area begins properly in 2008, when I first picked up Flash professionally. Although I'd flirted with flash back when it was a Macromedia product, I hadn't really played with it in years and starting my new job at Coolpink threw me in at the deep end. Fortunately it seemed to just 'click' and since then I've enjoyed attending conferences, learning new techniques and building cool experiences with Flash. I've made a lot of interesting things with Flash and Actionscript and it's pretty much become my main focus. Given my relatively short amount of time working with Flash, however, this whole situation is a bit confusing and a little bit worrying. I'm sure I'm not alone here... </p>\n\n<!-- more -->\n\n<p>In a nutshell here's what I don't understand about this situation. The iPad is surely powerful enough to run Flash Player but doesn't. Flash doesn't perform as well on OS X as on Windows but Apple block access to APIs that would mean performance boosts. Web designers and developers seem to constantly cry fowl about Flash being a proprietary platform and say that HTML5 is a much better alternative, but it's currently miles off being good enough to rival what you can achieve with Flash and the Canvas element which makes it all vaguely interesting is in fact developed by Apple and isn't Open Source either!! Oh, and HTML5 seems to be more of a performance hog than Flash for a great many tasks. </p>\n\n<p>When I was at uni (back in the dark days of the early 2000s) I was pushing the use of CSS over tables. It made sense, it was a better solution. So when someone at work suggested that HTML5 and CSS3 would render Flash pointless I decided to give this 'new' way of working a go. It sucked. I wanted to put a drop shadow on something and ignoring the lack of blend modes etc. I just couldn't get it to work. On a mixed background, some parts of the shadow were too strong and in other parts it looked like a glow. Rubbish!</p>\n\n<p>For me, a lot of the bad press that Flash seems to get is not down to how the runtime performs, but how shoddy the development of the site or app is in the first place. You've only got to look at things like the Hobnox Audiotool (<a href=\"http://www.audiotool.com\">www.audiotool.com</a>) to see how much performance it is possible to get from the Flash Player. It feels like Apple are being deliberately destructive here and given that they have sold a lot of hardware to creatives because of the Adobe suite of products it's very confusing. </p>\n\n<p>Let's not forget that Google and RIM (makers of the Blackberry) have recently partnered with Adobe to help push the Flash platform forward, specifically on mobile devices. I've seen Flash Player 10.1 running on mobile devices and it performs really well. It certainly performs well enough on netbooks and in the past month my native Apple apps have crashed more than a browser running Flash. </p>\n\n<p>Steve Jobs saying that intermediate layers create poorer experiences is nonsense, and I'll back up the many previous voices that have said that the blame for poor experiences lies with poor developers, not the tools they use. My personal feeling is that Apple really don't want Flash Player on the iPhone/iPod/iPad because it would undermine profits from the App store. The cross compilation from the Flash IDE seems a bit more murky as there may be some truth in the technical problems that it may cause with the new version of the iPhone OS but even so, why put that clause in there? If Flash compiles apps that don't work, developers won't use it, just like they won't use Lua, Monotouch or Unity if they don't work properly! The key is letting the developer choose. </p>\n\n<p>So what does this all mean for me really? I will continue to use Flash for personal experiments and projects and I will continue to recommend it as a solution for clients where it is suitable but the shockwave (poor pun) of the Apple tactics have already started to be felt as we've seen clients questioning the use of Flash a lot more. I hope it doesn't die out as I've developed a wide and in-depth set of skills for working with AS3 and Flash, however, I'd like to think that I could use my knowledge to produce quality work on any platform using any tools or language. </p>\n\n<p>My worry for the future is that this whole debate confuses people that don't really know enough about Flash or HTML5. I fear that clients will start requesting that work is not carried out in Flash without proper justification. Even if it is the best technology to solve their brief they'll be scared because of the storm that this debate has whipped up. Flash suddenly seems to have become the whipping boy. </p>\n\n<p>Should people just starting out working with Flash be worried? I'd say not, so long as they are prepared to learn design and development from the ground up. As always, the aim should be to become a great designer or coder, not just a great Flash designer or Actionscript coder.</p>"
    },
    {
      "publishedAt": "2010-03-26T17:37:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "26th March 2010",
      "year": "2010",
      "month": "03",
      "slug": "drag-and-be-happy",
      "title": "Drag and be happy!",
      "path": "posts/2010-03-drag-and-be-happy.html",
      "content": "<p>Inspired by Erik Natzke this is an experiment with particles and chains to produce some pretty patterns!<!-- more --></p>\n\n<p><a href=\"http://www.ian-thomas.net/drag-and-be-happy\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/unknown.png?w=48\" alt=\"\" title=\"\" /></a></p>\n\n<p><strong>DragAndBeHappy.swf</strong>\n<a href=\"http://posterous.com/getfile/files.posterous.com/anatomic/ixc5jU9rcaaYCCBvQaTflxUqpmmqYdUHffKmymLfpwiupn49SHKhlyNGlJlc/DragAndBeHappy.swf\">Download this file</a></p>\n\n<p>This effect is created by using the graphics API to draw the particles and then draw straight lines linking them.  Moving the mouse causes the particles to chase each other (and the mouse) and easing is applied to allow for some interesting shapes to be made.</p>\n\n<p>Each frame is drawn to a bitmap which is made slight more transparent each frame to create the fade effect.</p>\n\n<p>The next step is adding in width to the line to create a ribbon effect and I'll be posting that up soon!</p>"
    },
    {
      "publishedAt": "2010-03-10T09:55:00.000Z",
      "publishedAtHuman": "4 years ago",
      "publishedAtFormal": "10th March 2010",
      "year": "2010",
      "month": "03",
      "slug": "fitc-amsterdam-diary-day-2",
      "title": "FITC Amsterdam Diary - Day 2",
      "path": "posts/2010-03-fitc-amsterdam-diary-day-2.html",
      "tags": [
        "Conference",
        "FITC Amsterdam",
        "Flash"
      ],
      "content": "<p>It's taken far too long to get this post up, so many apologies but I hope something of interest comes from it anyway!</p>\n\n<p><strong>An unusual start...</strong></p>\n\n<p>Day 2 started with a really odd, but cool, surprise - I won an FITC custom bike!!  There had been a competition where a random tweet from someone at the conference would be chosen and that person would win one of the bikes on display in the Felix Meritis lecture halls.  Winning a bike was cool, getting it home, however, was not going to be!! Sadly, the cost of transporting the bike was going to be too high, so I left it with one of the Dutch Flash guys I met during the conference.<!-- more --></p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/03/img_0219.jpg?w=225\" alt=\"Img_0219\" title=\"\" /></p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/03/img_0224.jpg\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/03/img_0224.jpg?w=300\" alt=\"Img_0224\" title=\"\" /></a></p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/03/img_0226.jpg?w=225\" alt=\"Img_0226\" title=\"\" /></p>\n\n<p><strong>3D For The Masses - Carlos Ulloa</strong></p>\n\n<p>Back in November I attended a very in-depth training course with Carlos, so a lot of his presentation wasn't that new to me.  As always, his work was incredible and included his most recent experiments with Unity 3D on both the iPhone and using the desktop plugin.  If you've not had a chance to check out his Hello Racer site, the go and do so now, it's ace!  <a href=\"http://www.helloracer.com\">www.helloracer.com</a></p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/03/img_0202.jpg?w=225\" alt=\"Img_0202\" title=\"\" /></p>\n\n<p><strong>Building Maintainable Applications with PureMVC - Javier Julio</strong></p>\n\n<p>Javier was one of the intrepid FITC attendees that met up on Sunday night to get some pancakes after organising dinner using Twitter and I'd had his talk earmarked as one to see before attending the conference as I'd used PureMVC on several projects for Warner Music.</p>\n\n<p>His presentation was well organised, informative and above all interesting.  I was kind of dropped in at the deep end with the PureMVC projects I'd worked on, so it was good to see what I'd done correctly and what, if anything, was wrong with my implementation.  PureMVC is definitely up there as one of the best implementations of a framework for AS3/Flash/Flex and Javier managed to communicate it's strengths really well.</p>\n\n<p><strong>Work / Play - Seb Lee-Delisle</strong></p>\n\n<p>I have always really enjoyed Seb's talks, and the work he shows is always inspiring and brilliant.  This talk wasn't about anything new that he's been working on, though I'd never seen his anaglyphic 3D stuff before so that was really cool.</p>\n\n<p>The work he does for both Plug In Media (<a href=\"http://www.pluginmedia.net\">www.pluginmedia.net</a>) and as personal projects (<a href=\"http://www.sebleedeslisle.com\">www.sebleedeslisle.com</a>) is incredible - if you've not come across any of it, check out Big And Small and you'll soon see why he's held in such high regard. (<a href=\"http://www.bbc.co.uk/cbeebies/bigandsmall/games/bigandsmallhouse/\">http://www.bbc.co.uk/cbeebies/bigandsmall/games/bigandsmallhouse/</a>)</p>\n\n<p>We couldn't quite get the hang of 3D pong (but gave it a good go) but I think that the other main piece of work that amazed everyone was the lunar lander game he created.  To be able to produce something that cool with a file size of 5K is absolutely stunning!</p>\n\n<p><a href=\"http://www.ian-thomas.net/fitc-amsterdam-diary-day-2\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/03/img_0206.png?w=224\" alt=\"\" title=\"\" /></a></p>\n\n<p><strong>IMG_0206.MOV</strong>\n<a href=\"http://www.ian-thomas.net/fitc-amsterdam-diary-day-2\">Watch on Posterous</a></p>\n\n<p>Although Seb may disagree, his early start for the day (3am to get from Brighton to Amsterdam on time) actually enhanced his already humorous and typically British humour and though I was sat there laughing away I did wonder whether some of the other attendees 'got' his sense of humour.</p>\n\n<p><strong>The Cool Shit Hour</strong></p>\n\n<p>This was a mixed bag really, especially the poor guy that stood up to talk about motion graphics but couldn't the projector resolution correct so ended up showing us a tiny corner of a website.</p>\n\n<p>In brief, the talks included a demonstration of some voice recognition stuff (using the new features in Flash Player 10.1), Infrared5's BrassMonkey WiFi communication framework that allowed the Trench Run iPhone app control the desktop version of the game over the WiFi network, Peter Nitsch's ASCII vimeo (<a href=\"http://www.asciimeo.com\">www.asciimeo.com</a>), Samuel Agesilas showing us his dynamic layout framework Orchid (for use in Saffron) and the aforementioned motion graphics disaster from KGB Amsterdam!</p>\n\n<p><strong>Cinema 4D</strong></p>\n\n<p>After the cool shit I snuck down to the Dylan Ariana Room to see Cinema4D in action.  It looks like a great piece of software and I'd like to give it more of a go but unfortunately our production at the moment is so tight for time I think my 3D stuff will have to stay using Blender.  I do hope to get to grips with Cinema4D as the motion graphics stuff looked really nice (and the animation controls seem to be very intuitive).</p>\n\n<p><strong>North Kingdom - An Inside View</strong></p>\n\n<p>Anyone that works with Flash will know about North Kingdom and the exceptional quality of work that they put out so this talk was one that I'd triple circled in the FITC schedule as a 'must not miss'.</p>\n\n<p>David Eriksson (Creative Director and CEO), who is a surprisingly shy and nervous guy given the stature of his company and his physical presence, talked us through the NK process overall and then specifically through the Teamgeist project they delivered for Adidas.</p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/03/img_0213.jpg?w=225\" alt=\"Img_0213\" title=\"\" /></p>\n\n<p>Seeing how the company is set up, their process, the attention to detail in everything they do (including mock ups and sketches) and their values was really inspirational and gave me something to aspire to in my professional life.  A great talk.</p>\n\n<p><strong>Wrap Party</strong></p>\n\n<p>The wrap party at Supperclub was great (especially the free bar)!  I got chatting to some friends I'd met during the conference and also some of the speakers (including a funny chat about international differences with Chris Allen!) with the best bit being the chance to bend the ear of Erik Natzke about his work.</p>\n\n<p>I managed to nab Fernando Colaco's fold up bike at the end and had fun pulling out some tricks on the dancefloor (badly) - thankfully he's falsely accused somebody else of robbing his bike on the ActionscriptHero.org site so I think I've got away with that one!!</p>\n\n<p><strong>Home again</strong></p>\n\n<p>With the conference over, I headed home on the same flight as some very hungover looking boys from Fuse8 and landed back in Yorkshire to be greeted by fog and snow, the UK really is a wonderful place! </p>"
    },
    {
      "publishedAt": "2010-02-23T01:08:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "23rd February 2010",
      "year": "2010",
      "month": "02",
      "slug": "fitc-amsterdam-diary-day-1",
      "title": "FITC Amsterdam Diary - Day 1",
      "path": "posts/2010-02-fitc-amsterdam-diary-day-1.html",
      "tags": [
        "Conference",
        "FITC Amsterdam",
        "Flash"
      ],
      "content": "<p>FITC got started properly today and judging by the crush to get into the Keynote by Richard Galvan and Mark Anders it was going to be a busy day!</p>\n\n<p>The Adobe guys walked us through the new features in Flash Player 10.1 and Flash Pro CS5 in what was a fairly predictable session. It was interesting to see them showcasing 10.1 running on a wide variety of devices (including mobile phones) and I have to say the performance looked pretty good.  Flash CS5 and the iPhone packager have been fairly widely covered in the past few months and some hands on experience meant that there were no surprises there for me.  Just for the record, CS5 is looking good and brings some really interesting new features that I'm sure will up the quality of Flash output in the coming years - the Text Layout Framework options certainly being one of the standout additions.<!-- more --></p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/02/pastedgraphic-1-tiff-converted.jpg?w=225\" alt=\"Pastedgraphic-1\" title=\"\" /></p>\n\n<p>Of particular interest (well, if we don't include Richard Galvan's tongue in cheek shirt!) was the announcement that Google and RIM (makers of the BlackBerry mobile devices) have joined the Open Screen Project.  There were a load more latest additions, but these two names in particular meant that there was one very ominous and obvious corporation missing.</p>\n\n<p>This whole Apple and Adobe situation has been done to death so I'm going to keep my comments brief.  With Google (not so much RIM here) signing up, you've got to wonder which of the heavyweights will win out between Adobe and Apple, as Google is now so huge and powerful you could almost liken it to The Internet vs. The Mobile Phone.  My personal opinion is that Apple don't want to lose out on income through flash games becoming available for iPhone and iPad, thus removing their stranglehold on monetizing applications for their platform.</p>\n\n<p><strong>The Speakers</strong></p>\n\n<p>Today's line up was immense, featuring some true legends of the interactive and generative art world.  I wish I could have seen all of the sessions as there were many that got rave reviews and looked great.  It was the offering in the main room that I was really interested in, with such luminous speakers as Mario Klingemann, Grant Skinner, Ralph Heuwart, Jared Tarbell and Erik Natzke all presenting.</p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/02/img_0185.jpeg?w=225\" alt=\"Img_0185\" title=\"\" /></p>\n\n<p>Mario 'Quasimondo' Klingemann got things going nicely with some incredible graphics produced solely using actionscript and maths -  something that I've been experimenting with more and more recently.  He also gave a glimpse into the world of an obsessive organiser by showing his holiday beach snaps where he'd collected and sorted all manner of beach junk before making some home made geometry tools to make maths images in the sand!  </p>\n\n<p>Oh, and I nearly forgot about his challenge to encode a graphic into 140 characters to put on Twitter.  Do a search on Google for it, it's highly geeky and massively creative!</p>\n\n<p>Grant's talk about optimisation was great, though a little dry when compared with some of the other speakers' offerings.  He is <em>the</em> authority when it comes to talking about optimising code for the Flash Player and as a result I've got some five pages of notes from his talk.  This was possibly the single most business relevant and useful talk I attended today.</p>\n\n<p>After meeting up with a new friend for lunch, I headed back to the Felix Meritis for three more incredible talks.  Ralph UnitZeroOne was up first and the guy is crazy.  Crazy and brilliant.</p>\n\n<p>I'd love to talk you through his session, but honestly it boils down to three things, stunning work, massive intelligence and Pixel Bender.  I've got a video to download that shows his parting shot (that was simply amazing) and I'll post it as soon as I can get it online.  Check out his effort for <a href=\"http://www.letitbloom.com\">http://www.letitbloom.com/#ralph</a> in the meantime, it's 15 000 particles of sheer beauty.</p>\n\n<p>Jared Tarbell's talk about 'The Strangest Things I've Ever Seen' showed the work he's done in the generative art world that follows on from his highly inquisitive and creative nature.  It was a beautifully delivered presentation that featured some really great work.  Inspirational stuff and you should try and catch this guy speaking any time you get a chance.  I particularly enjoyed that he talked about ideas and thoughts and didn't go into much depth about code and how to do what he did.  It's the way I try to work, leading with ideas and concepts and following up with the technical solution that fulfils that vision best, not providing a solution based on a certain technology or technique because it's what I've just learnt or the latest fashion.</p>\n\n<p>The last talk of the day was Erik Natzke, someone that I've bored many a person back at home about.  His session walked us through how he came to produce the various styles of work that he's become known for, and again it was the curiosity that he showed in his work that truly impressed me.  I think his output is fantastic and it was great to see some of his prints close up (they are crazy in the amount of detail!) though at 300 Euro a pop I couldn't really splash out to bring one home with me.</p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/02/img_0196.jpeg?w=225\" alt=\"Img_0196\" title=\"\" /></p>\n\n<p>Erik showed how the out-there, conceptually rich endeavours that he's undertaken could be combined with the commercial needs of a graphic designer to ultimately provide a very fulfilling and exciting career.  Please check out his work if you can, it's nothing short of stunning! If you get the chance to see him speak, you'll be even more in awe as you see just how much thought and effort goes into each piece of work - it's definitely not just input photo, turn on Natzke filter, get artwork!</p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/02/img_0197.jpeg?w=225\" alt=\"Img_0197\" title=\"\" /></p>\n\n<p><strong>Apres FITC</strong></p>\n\n<p>This evening a few of us that met yesterday were joined by some new faces for dinner at Ocho in the centre of Amsterdam.  It was another great evening of getting to know fellow designers and developers from around the world - we had people from America, Belgium, Brazil, France, Germany, Portugal and the UK.  FITC is proving to be a great conference, packed with passionate and friendly people from around the world.  </p>\n\n<p>Bring on more tomorrow!!</p>"
    },
    {
      "publishedAt": "2010-02-21T23:28:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "21st February 2010",
      "year": "2010",
      "month": "02",
      "slug": "fitc-amsterdam-diary-workshop-day",
      "title": "FITC Amsterdam Diary - Workshop Day",
      "path": "posts/2010-02-fitc-amsterdam-diary-workshop-day.html",
      "content": "<p>Today was day zero of the FITC Amsterdam conference with three workshops being held in the Felix Meritis centre, a gorgeous building inside and out, with some really unusual features. Our workshop was on the first floor and the room had a large ceiling with huge pillars lining the longest sides. The main Concertzaal room is equally impressive and spacious - though it needs to be judging by how popular the event is!</p>\n\n<p>I was booked to attend the Byte My Flash track, hosted by Lee Brimelow and Thibault Imbert, a full day workshop about programming at byte level in Actionscript 3. The two other tracks covered custom events and getting creative using the HYPE framework and both looked good. I was a bit gutted to not get to see Branden Hall and I think this could be a recurring problem with such a talent packed schedule of events!</p>\n\n<p>The ByteArray workshop definitely had the potential to get quite gnarly but for the most part it was kept at a good, understandable level. Lee is an accomplished and excellent speaker about programming flash and Thibault is a crazy French Actionscript ninja so we were in safe hands. The hardest thing seemed to be getting the Flex 4 and AIR 2.0 frameworks set up properly for Thibault's topics - I'll echo Lee's comment about Flex and the trouble it causes! (As a quick side note, check out bytearray.org - it's Thibault's blog and has so much crazy stuff packed into it!) </p>\n\n<p>We covered stuff like making a custom FTP client, decoding PSD and BMP images, creating sounds from code, reading pop mail and finished by making an air app that uses the AIR 2.0 NativeProcess class to encode live microphone data to an mp3 file. Pretty damn cool stuff and only a taster of what is possible when you work at byte level. It's exciting to think how much potential there is to extend the Flash Player. </p>\n\n<p>Even cooler (potential oxymoron coming up) was the World of Warcraft demo from Mike Chambers, showing us a neat app that could send images over a socket to a client on an iPhone developed in Flash CS5. Impressive! </p>\n\n<p>After the workshop I went back to the hotel for a bit and checked on twitter to see what sort of buzz there was about FITC and to see if there was anyone around that fancied chatting about flash over dinner. </p>\n\n<p>One of the things I really enjoy about working with the Flash Platform is the community and tonight was a great example of how strong it is. Five of us (the majority strangers to one another) met at the Pancake Bakery in the North of the city after arranging to meet up on Twitter. It was great, especially given that I'm the only person from Coolpink to head over (all alone in the big city!) and didn't know anyone here in Amsterdam. It was really interesting to see how different nationalities go about their business and how their industry is viewed by their surrounding economy - I never want to work as a Flash Designer in Portugal! </p>\n\n<p>That's it for today, I'm putting my feet up in the hotel bar and getting ready for a really busy day tomorrow. So many good talks, but I'm really excited to see Erik Natzke and Ralph Hauwert. Looking at the schedule I think I'm going to be camping out in the main room!</p>"
    },
    {
      "publishedAt": "2010-01-20T18:21:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "20th January 2010",
      "year": "2010",
      "month": "01",
      "slug": "playing-with-graphics-making-pretty-patterns-from-sound-with-actionscript-3",
      "title": "Playing with graphics: making pretty patterns from sound with Actionscript 3",
      "path": "posts/2010-01-playing-with-graphics-making-pretty-patterns-from-sound-with-actionscript-3.html",
      "content": "<p>Bit of a big one to download but worth the wait - using code to produce interesting graphics based on data from a song.<!-- more --></p>\n\n<p><a href=\"http://www.ian-thomas.net/playing-with-graphics-making-pretty-patterns\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/unknown.png?w=48\" alt=\"\" title=\"\" /></a></p>\n\n<p><strong>EmbeddedSound.swf</strong>\n<a href=\"http://posterous.com/getfile/files.posterous.com/anatomic/w9XJsUqcDc5CJppSImuyQs6Bg9JUqaVpygAmh0ZWcwNTVBJUrM7wUXsESMjq/EmbeddedSound.swf\">Download this file</a></p>\n\n<p>Song used is Calvertron - Doggy Style (Zodiac Cartel Mix)</p>"
    },
    {
      "publishedAt": "2010-01-20T14:57:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "20th January 2010",
      "year": "2010",
      "month": "01",
      "slug": "performance-test-with-as3-and-thousands-of-particles",
      "title": "Performance test with AS3 and thousands of particles",
      "path": "posts/2010-01-performance-test-with-as3-and-thousands-of-particles.html",
      "content": "<p>I've never experimented with using bitmapData and the copyPixels() method to increase performance when animating a large number of particles so I thought I'd have a quick play to see what could be achieved. </p>\n\n<p>This demo has 2000 particles that bounce off the walls, have gravity and friction and are given a small motion blur and it manages a nice 24/25 fps (see the stats). <!-- more --></p>\n\n<p><a href=\"http://www.ian-thomas.net/performance-test-with-as3-and-thousands-of-pa\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/unknown.png?w=48\" alt=\"\" title=\"\" /></a></p>\n\n<p><strong>emergentBehaviour2.swf</strong>\n<a href=\"http://posterous.com/getfile/files.posterous.com/anatomic/AcYszZEpiMnii3m3M8LtfYUHz9iazvEgFxvum3tsUzRbQeRopXNL6UTECjUc/emergentBehaviour2.swf\">Download this file</a></p>\n\n<p>As I said above, this is a first proper experiment where I've tried to bypass the Flash Player vector renderer and I'm amazed by the results! </p>\n\n<p>Click your mouse to restart the animation.</p>"
    },
    {
      "publishedAt": "2010-01-14T14:40:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "14th January 2010",
      "year": "2010",
      "month": "01",
      "slug": "starting-to-play-around-with-generative-art-using-actionscript-3-0",
      "title": "Starting to play around with generative art using Actionscript 3.0",
      "path": "posts/2010-01-starting-to-play-around-with-generative-art-using-actionscript-3-0.html",
      "content": "<p>Up until recently I've not had much of a chance to play with generative art, though it's something that I've meaning meaning to check out for ages.  I've looked into Processing and had a little play with NodeBox before, but have never really used Flash in this capacity.  Flash, however, is an excellent environment to get into generative art as coding on the timeline can be loose and fast, with no need to get into classes and objects (unless you want to).  I think the term is 'sketching' and it's a good way to think of this sort of coding.  It's coding for designers, not developers.  Quick (and dirty) little scripts with no regard for performance that solely exist to produce interesting (if not beautiful) graphical output.</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2.png?w=300\" alt=\"Lissajousexperiment_3x2\" title=\"\" /></a></p>\n\n<p><strong>Lissajous Curve</strong></p>\n\n<p>Lissajous is a term that I've heard several times, most recently from Brendan Dawes (<a href=\"http://brendandawes.com\">http://brendandawes.com</a>) as he used the formula in his recent 'Elena' iPhone app.  Lissajous Curves (or Bowditch Curves) refers to a family of curves investigated by Nicholas Bowditch and later by Jules Antoine Lissajous and are produced from the following equations:</p>\n\n<p>x = A sin(at + d), y = B sin(bt)</p>\n\n<p>I don't profess to being an expert in this field, so I'd highly recommend having a good search for more information.</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_91x91.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_91x91.png?w=300\" alt=\"Lissajousexperiment_91x91\" title=\"\" /></a></p>\n\n<p>The curves change quite dramatically when the constants in the equations are changed, with some of the most interesting patterns happening if they are changed over time.</p>\n\n<p><strong>Some images</strong></p>\n\n<p>Below are some of the images that I've produced using these equations.  There's nothing more complicated than drawing dots, squares and lines involved in most of them.  I found that the code tends to change quite fluidly after a 'run' and this is something that I really enjoyed about this sort of work.  It changes, it evolves.  There's a constant 'what if...?'  You are encouraged to explore different algorithms and different ideas to see what happens.  It brings back the 'happy accident' to coding.  Although I've not done that much yet, I can definitely see myself turning to generative art as a break from photoshop and more application based flash development.</p>\n\n<p><strong>Further reading</strong></p>\n\n<p>If this has got you thinking about generative art, I'd definitely recommend reading some of the posts from the following people:</p>\n\n<ul>\n<li><p>Keith Peters (Bit 101) - <a href=\"http://www.bit101.com\">www.bit101.com</a> <a href=\"http://www.artfromcode.com\">www.artfromcode.com</a></p></li>\n<li><p>Erik Natzke - <a href=\"http://jot.eriknatzke.com/\">http://jot.eriknatzke.com/</a></p></li>\n<li><p>Joshua Davies - <a href=\"http://www.joshuadavis.com/\">http://www.joshuadavis.com/</a></p></li>\n<li><p>Brendan Dawes - <a href=\"http://www.brendandawes.com\">http://www.brendandawes.com/</a></p></li>\n<li><p>Quasimondo - <a href=\"http://www.quasimondo.com/\">http://www.quasimondo.com/</a></p></li>\n<li><p>Zen Bullets - <a href=\"http://zenbullets.com/blog\">http://zenbullets.com/blog</a></p></li>\n<li><p>Dr. Woohoo! - <a href=\"http://www.drwoohoo.com/\">http://www.drwoohoo.com/</a></p></li>\n</ul>\n\n<p>Also check out <a href=\"http://www.letitbloom.com/\">http://www.letitbloom.com/</a> for some great work by the above people and more (hint, press refresh!).</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_b.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_b.png?w=300\" alt=\"Lissajousexperiment<em>3x2</em>b\" title=\"\" /></a>\n<a href=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_c.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_c.png?w=300\" alt=\"Lissajousexperiment<em>3x2</em>c\" title=\"\" /></a>\n<a href=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_d.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_d.png?w=300\" alt=\"Lissajousexperiment<em>3x2</em>d\" title=\"\" /></a>\n<a href=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_dots.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_dots.png?w=300\" alt=\"Lissajousexperiment<em>3x2</em>dots\" title=\"\" /></a>\n<a href=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_e.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_3x2_e.png?w=300\" alt=\"Lissajousexperiment<em>3x2</em>e\" title=\"\" /></a>\n<a href=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_13x2.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/lissajousexperiment_13x2.png?w=300\" alt=\"Lissajousexperiment_13x2\" title=\"\" /></a></p>\n\n<p><a href=\"http://www.ian-thomas.net/starting-to-play-around-with-generative-art-u\">See the full gallery on Posterous</a></p>"
    },
    {
      "publishedAt": "2010-01-08T15:55:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "8th January 2010",
      "year": "2010",
      "month": "01",
      "slug": "how-to-reuse-actionscript-code-when-working-with-flash-cs4-a-quick-as3-tutorial",
      "title": "How to reuse actionscript code when working with Flash CS4 - a quick AS3 tutorial",
      "path": "posts/2010-01-how-to-reuse-actionscript-code-when-working-with-flash-cs4-a-quick-as3-tutorial.html",
      "content": "<p>Just a quick one this, hopefully showcasing how to use classes with MovieClips in Flash CS4.  I'll cover two basic methods, one ties different MovieClips to a base class and the other re-uses a button class.</p>\n\n<p><strong>Making a reusable button</strong></p>\n\n<p>To keep it quick and easy this will be a simple fade in and out effect on a button so start off by making a button design that contains a dynamic text field with an instance name of 'label'.</p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_34.png?w=300\" alt=\"Picture_34\" title=\"\" /></p>\n\n<p>Once our MovieClip is created, it needs to be setup to export for ActionScript.</p>\n\n<p><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_35.png?w=214\" alt=\"Picture_35\" title=\"\" /></p>\n\n<p>First, open the properties for the symbol in the Library, then tick the 'Export for ActionScript' box and fill in the correct linkage. </p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_36.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_36.png?w=279\" alt=\"Picture_36\" title=\"\" /></a></p>\n\n<p>Notice here that for the class I've typed in net.anatomicdesign.Button - this is something that I'd encourage any developer to do as it is industry best-practice.  For small things like this it doesn't make too much sense, but on larger projects organising your classes into proper packages is really important so it's good to get into good habits.</p>\n\n<p>From here, create a new ActionScript3 document called Button.as and save it in the folder net/anatomicdesign/ (or whatever the package names are that you choose to use).</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_37.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_37.png?w=300\" alt=\"Picture_37\" title=\"\" /></a></p>\n\n<p>Now it's just a case of filling in the code.  I normally start off by deciding what I want to happen in a class and then building up functionality from there so, for the button class we'll typically need event listeners for mouse over, out and click.  From here, you can go on to insert the code needed to animate the button (perhaps using a Tweening library such as TweenLite) in the correct functions.  Note that if the button needs any setting up, that code should be added to the constructor (the function that is given the same name as the class).  For this example, I'm adding a parameter to the button that sets the button's label and I'm also going to alpha out the button slightly.</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_41.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_41.png?w=300\" alt=\"Picture_41\" title=\"\" /></a></p>\n\n<p>To use the button you can either place instances on the stage and set the labels using timeline code (using the setLabel function) or you can simply delete the instance from the stage and add the button using code such as</p>\n\n<p><code>var buttonA:Button = new Button('First Button');</code></p>\n\n<p><strong>Giving different button designs the same functionality</strong></p>\n\n<p>A slight twist on the previous example is using a base class to provide the same functionality to different MovieClips.</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_39.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_39.png?w=300\" alt=\"Picture_39\" title=\"\" /></a></p>\n\n<p>Instead of linking the Class to the Button.as, we'll leave the name the same as the Symbol name and instead set the Base Class to be Button.as</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_40.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_40.png?w=279\" alt=\"Picture_40\" title=\"\" /></a></p>\n\n<p>Doing this, Flash will create a unique class for the button at runtime, but it will inherit the super class' functions.  So if Button.as (at its most basic) looked something like the code below, any button that had the Base Class set to Button.as would be  ready with listeners setup for mouse over, out and click.  This could be taken further if you wanted them to have the same animation/tweened properties by adding the appropriate code to the relevant functions.</p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_42.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/01/picture_42.png?w=300\" alt=\"Picture_42\" title=\"\" /></a></p>\n\n<p>Hope this helps out some people that are just getting to grips with Object Oriented Programming within Flash using ActionScript 3.  AS3 is really powerful and a lot faster than AS2 so keep plugging away if you're struggling, it'll all be worth it in the end!!</p>"
    },
    {
      "publishedAt": "2009-12-26T13:17:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "26th December 2009",
      "year": "2009",
      "month": "12",
      "slug": "actionscript-3-display-list-tutorial-part-1-getting-to-grips-with-the-basics",
      "title": "Actionscript 3 Display List Tutorial Part 1: Getting To Grips With The Basics ",
      "path": "posts/2009-12-actionscript-3-display-list-tutorial-part-1-getting-to-grips-with-the-basics.html",
      "tags": [
        "actionscript 3",
        "Flash",
        "tutorial"
      ],
      "content": "<p>I've been meaning to write a little introduction to the Display List for quite some time so hopefully this post will provide some very useful tips and tricks for people that are just delving into working with AS3. It's not an advanced tutorial but hopefully there'll be something of use to most Flashers!</p>\n\n<p>To start with AS3 is different to AS2 in that a display object doesn't have access to the Stage until it is added to the display list. This is a key thing to keep in mind when working with movieclips and sprites in code, especially when trying to initialise a movieclip that needs to know the stage size before it is added to the display list. This might sound weird if you're new to Flash and haven't touched AS2, but if you're coming from AS2 it's an important change to the way everything works. With that out of the way, what is the display list?</p>\n\n<p><strong>Display List Basics</strong> <br />\nThink of the Display List like a family tree. Sitting at the top is the Stage, it's the top level display object container and if you want to have something visible to the user then that movieclip (or sprite) needs to be added as a child to the stage. This looks something like this:</p>\n\n<p><code>\n  stage.addChild(myDisplayObject);\n</code></p>\n\n<p>With AS3 you don't necessarily need to write that line of code, especially if you are working with a Document Class. Typically you will write the code like this</p>\n\n<p><code>\n  this.addChild(myDisplayObject); //when working inside the Document Class\n  myDocumentClass.addChild(anotherDisplayObject); //when working with a class that holds a reference to the Document Class\n</code></p>\n\n<p>Now, in this family tree business you don't have everyone with one parent (that would be madness) - you have variations generations of parents and children (who can become parents themselves). The Display List works in a similar way with Movieclips and Sprites having functionality to be parents to other Movieclips (and Sprites) as well as children. In its simplest form this means that you can add Movieclips to other Movieclips as children. The key thing here is that an object can only have one parent, but (unlike the family tree metaphor) that parent can be changed at any time. You can also remove an object from the Display List completely. The following example shows some variations of adding, re-parenting and removing objects from the Display List.</p>\n\n<p>`\n  var a:MovieClip = new MovieClip();\n  var b:MovieClip = new MovieClip();\n  var c:MovieClip = new MovieClip();</p>\n\n<p>stage.addChild(a); //add the first movieclip to the stage\n  b.addChild(c); //add c to b. NOTE: neither of these two clips are on the stage yet, as the parent hasn't been added to the display list\n  a.addChild(b); //now all three are visible as a is the parent of b and a has already been added to the display list</p>\n\n<p>a.addChild(c); //we have re-parented c from b to a so both b and c are children of a</p>\n\n<p>a.removeChild(b); //the only items visible now are a and c\n `</p>\n\n<p>The order that you add children to a parent determines their depth in the list, with the last added child being the highest up in the Display List. This is important to remember if you find that objects are hiding other objects in a way that you don't want. If you find yourself in this situation you can simply add the hidden object again (no need to remove it) and that will move it to the top of its parents list.**</p>\n\n<p>What Else Can You Do With This? <br />\n**This is working with the display list at its most basic and doesn't really hold much of interest other than getting your objects to be viewable by the user. I'll go over some more advanced techniques in the next part of the tutorial (which starts to look at other functions that allow you to work with the Display List) but as a parting shot I'll just cover some ways to hide objects from view.</p>\n\n<p>The Flash Player isn't the most performance savvy piece of software so whenever possible you have to lighten it's processing load to get the best possible performance and hiding objects is one little tip that can claw back precious miliseconds of processing. Simply put, setting a Movieclip's alpha value to 0 will still result in a performance hit as it will still be rendered by the Flash Player. Typically if you are going to set alpha to 0, you should also set visible = false for that object so that the Flash Player will ignore that object when doing a render. It doesn't seem like much when you're working on a small project, but if you start working with a large number of Movieclips this sort of optimisation becomes absolutely essential.</p>\n\n<p>Lastly, if you're not going to need a Movieclip for quite some time (if at all) then it's best to remove it from the Display List altogether. To sum up:</p>\n\n<p>`\n  myClip.alpha = 0; //bad</p>\n\n<p>myClip.alpha = 0;\n  myClip.visible = false; //better</p>\n\n<p>stage.removeChild(myClip); //best - substitute stage for the clip's parent\n `</p>"
    },
    {
      "publishedAt": "2009-12-01T17:11:19.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "1st December 2009",
      "year": "2009",
      "month": "12",
      "slug": "another-augmented-reality-snapshot",
      "title": "Another Augmented Reality Snapshot",
      "path": "posts/2009-12-another-augmented-reality-snapshot.html",
      "content": "<p><a href=\"http://ianthomasnet.files.wordpress.com/2009/12/picture_4.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2009/12/picture_4.png?w=300\" alt=\"Picture_4\" title=\"\" /></a></p>"
    },
    {
      "publishedAt": "2009-11-26T18:04:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "26th November 2009",
      "year": "2009",
      "month": "11",
      "slug": "christmas-is-coming-sneak-peek-of-an-augmented-reality-christmas-tree",
      "title": "Christmas is coming!!  Sneak peek of an Augmented Reality Christmas Tree",
      "path": "posts/2009-11-christmas-is-coming-sneak-peek-of-an-augmented-reality-christmas-tree.html",
      "tags": [
        "Actionscript",
        "Augmented Reality",
        "Blender",
        "FLARManager",
        "FLARToolkit",
        "Flash",
        "Papervision3D"
      ],
      "content": "<p><img src=\"http://ianthomasnet.files.wordpress.com/2009/11/picture_1.png?w=300\" alt=\"Picture_1\" title=\"\" /></p>\n\n<p>This is something I've been doing at work and at home as a sort of cross over project.  It's not the end product but a proof of concept really.</p>\n\n<p>Looking forward to getting round a table with the movers and shakers of Coolpink to thrash out where we want to take this!</p>\n\n<p>This is my first effort using the excellent FLARManager (<a href=\"http://words.transmote.com/wp/flarmanager/\">http://words.transmote.com/wp/flarmanager/</a>), but not my first time messing around with the FLARToolKit (<a href=\"http://www.flartoolkitdocs.org/\">http://www.flartoolkitdocs.org/</a>) and Papervision3D (<a href=\"http://www.papervision3d.org\">http://www.papervision3d.org</a>).  FLARManager is excellent and really takes the hard work out of getting started with Augmented Reality and the FLARTookKit but still requires a good understanding of what's going on underneath the hood. </p>\n\n<p>If you're interested in working with FLARManager, I'd recommend reading the excellent article on Inside RIA written by <a href=\"http://www.oreillynet.com/pub/au/3803\">Eric Socolofsky</a> (the guy who created FLARManager) as it provides a really good overview of the project and how it all works (<a href=\"http://www.insideria.com/2009/07/flartoolkit-and-flarmanager.html). <br />\nhttp://www.insideria.com/2009/07/flartoolkit-and-flarmanager.html).<br /></p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2009/11/picture_3.png\"><img src=\"http://ianthomasnet.files.wordpress.com/2009/11/picture_3.png?w=284\" alt=\"Picture_3\" title=\"\" /></a></p>\n\n<p>For the 3D modelling part of this project I've been working with Blender (<a href=\"http://www.blender.org\">http://www.blender.org</a>) which is an Open Source 3D modelling/animation/etc. program in the vein of 3D Studio Max, Maya, etc.  I have to be honest, it's possibly the hardest piece of software to get started with, the interface is crazy, but there are plenty of great tutorials on the web and I'm sure most people are prepared to work a bit harder to learn something when it's completely free!</p>"
    },
    {
      "publishedAt": "2009-11-25T15:41:13.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "25th November 2009",
      "year": "2009",
      "month": "11",
      "slug": "flying-in-strips",
      "title": "Flying in strips",
      "path": "posts/2009-11-flying-in-strips.html",
      "tags": [
        "Actionscript",
        "Flash",
        "flash effects"
      ],
      "content": "<pre><code>I made this little demo after seeing the effect on another website and wondered if I could re-create it. \n</code></pre>\n\n<p>In a nutshell, the picture is chopped into angled strips (the angle is set in the code) and then each strip is flown in randomly to create quite a cool transition!</p>\n\n<p><a href=\"http://www.ian-thomas.net/flying-in-strips-0\"><img src=\"http://ianthomasnet.files.wordpress.com/2010/06/unknown.png?w=48\" alt=\"\" title=\"\" /></a></p>\n\n<p><strong>Main.swf</strong>\n<a href=\"http://posterous.com/getfile/files.posterous.com/anatomic/hMHUyF7R7gXryouMbeGqrxk1GcOqhehrDkwKFcHq2mIIcdj1XsFADZEzNJI4/Main.swf\">Download this file</a></p>\n\n<p><a href=\"http://www.ian-thomas.net/flying-in-strips-0\"><img src=\"http://posterous.com/images/filetypes/zip.png\" alt=\"\" title=\"\" /></a></p>\n\n<p><strong>chopUpFlyIn.zip</strong>\n<a href=\"http://posterous.com/getfile/files.posterous.com/anatomic/7dLBFRM3XJnHx1y6Aywi8Hh7tihAleg1AUz31eUBWBcvlCJo0TmbzQOS4dEe/chopUpFlyIn.zip\">Download this file</a></p>\n\n<p>Hopefully there should be a zip file attached to this post that you can download and have a look at the source (created in CS5 beta1)</p>"
    },
    {
      "publishedAt": "2009-11-19T10:28:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "19th November 2009",
      "year": "2009",
      "month": "11",
      "slug": "is-the-best-framework-no-framework",
      "title": "Is the best framework no framework?",
      "path": "posts/2009-11-is-the-best-framework-no-framework.html",
      "tags": [
        "Actionscript",
        "coding",
        "Design Patterns",
        "Flash"
      ],
      "content": "<p>Next week marks my first full year in a digital agency and also my first full year working with Flash. Prior to 2008 I'd never really touched Actionscript, tweens or movieclips so it's been a bit of a whirlwind getting to where I am now! </p>\n\n<p>Over the course of the past year I've worked on a variety of Flash projects, some simple banners, some larger sites and most recently database driven, content managed RIA's and widgets. The growing pains have been numerous and looking back at the early projects it's clear that I really didn't know what I was doing!! Having said that, there definitely is a case for the statement 'the more you know, the more you know you don't know', especially when it comes to project planning and code structure. </p>\n\n<p>Frameworks are something that I'd not really come across before (well I can't remember ever using one or learning about them at uni) so early projects didn't use them. I was still learning about events and how AS3 handles the Display List but thankfully I was using Object Oriented coding because that's what I grew up with. These projects had plenty of custom classes and navigating through the site relied on basic events and lots of code. Ultimately, the code wasn't re-usable because it was so bespoke for each project and every class was so reliant on other classes it was always going to be easier to re-write than re-use. </p>\n\n<p>Around June this year Coolpink won some business to design and develop multi-lingual widgets for one of the biggest record labels in the world. These widgets were to have (at least) 9 languages, different content that was updated through a bespoke content management system, a variety of media to be played and the artist's Twitter feed. Clearly some planning was needed! </p>\n\n<p>The custom, fudged code structure of previous projects wasn't going to wash so I investigated several different Actionscript frameworks. The consistent thread that ran through all of them was the MVC design pattern, and in the end PureMVC was chosen. It's worth noting that I've looked into Flex but always chosen not to use it, I don't know why but it feels clunky to use and I much prefer making custom components in the Flash IDE. </p>\n\n<p>Working with PureMVC takes some getting used to, but on reflection it did exactly what we needed. It separated business logic from the data and kept the visual components free of any back end code that would prevent them from being re-used or would make changing the data type/source very difficult. We didn't really need the controllers though and working out what needed to be in a Mediator class or the actual flash component caused quite a lot of head scratching. Talking to other developers recently it seems that this Mediator/view component relationship is one of the big issues with PureMVC. Do you control transitions in the PureMVC classes or build that into the view components separately? </p>\n\n<p>Most recently I was tasked with designing and building a product finder RIA that again worked with a bespoke content management system and pulled in various bits of data and media. This time, however, I chose to work without a framework but implement a loose version of the MVC design pattern. </p>\n\n<p>Without PureMVC it took much more discipline to structure the application but it also allowed for more flexibility. Obviously the experience of working with PureMVC had helped with the structure and planning of custom classes but without it the project took shape much more quickly and the interaction between different parts of the app felt a lot less 'round the houses'. Working without a framework was a good experience. </p>\n\n<p>Currently I'm working on an app that is going to be deployed on the desktop using Adobe AIR and I've chosen to use PureMVC again. I'm still struggling with the reasoning behind using PureMVC (or any open source framework for that matter) but I guess it comes down to producing something that other people can pick up and work with later. The other reason that I keep deliberating is about data flow and communication throughout the app. PureMVC's notifications were clear and understandable, going renegade and doing it my own way involved lots of custom events and adding event listeners to various components which ultimately became hard to keep track of. </p>\n\n<p>So, is the best framework no framework? Maybe, but more likely is that the best framework is a custom framework that is re-used and updated - not custom made for each project.</p>"
    },
    {
      "publishedAt": "2009-11-10T07:43:48.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "10th November 2009",
      "year": "2009",
      "month": "11",
      "slug": "it%e2%80%99s-apple-iphone-day-for-orange-uk-customers-mobile-industry-review",
      "title": "It’s Apple iPhone-Day for Orange UK customers | Mobile Industry Review",
      "path": "posts/2009-11-it%e2%80%99s-apple-iphone-day-for-orange-uk-customers-mobile-industry-review.html",
      "content": "<blockquote>\n  <p>This morning a whole raft of £35/month contract customers — who’ve previously been sitting staring at their bollocks Nokia / Sony Ericsson / Samsung / Windows Mobile Piece of Shit — are now free to contemplate a treat.</p>\n</blockquote>\n\n<p>via <a href=\"http://www.mobileindustryreview.com/2009/11/its_apple_iphone-day_for_orange_uk_customers.html\">mobileindustryreview.com</a></p>"
    },
    {
      "publishedAt": "2009-11-08T21:02:54.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "8th November 2009",
      "year": "2009",
      "month": "11",
      "slug": "advanced-papervision3d-training-in-london-with-carlos-ulloa",
      "title": "Advanced Papervision3D training in London with Carlos Ulloa",
      "path": "posts/2009-11-advanced-papervision3d-training-in-london-with-carlos-ulloa.html",
      "tags": [
        "Actionscript",
        "Flash",
        "Papervision3D"
      ],
      "content": "<pre><code>Last week Carlos Ulloa gave an intensive course on Advanced Papervision3D and I was one of the lucky seven that attended.\n</code></pre>\n\n<p>Carlos started off by explaining that he'd done big lectures, medium lectures and was now trying a different format as working with a large number of attendees often proved inefficient and really hard work.  I can vouch for the fact that as one of only seven on the course, two days with such a brilliant Flash developer in such closer quarters was absolutely amazing.</p>\n\n<p>The course covered everything from the ground up starting with \"the boring stuff\" (Carlos' words) that involved quality and optimisation and then moving into the more in-depth topics of what actually happens with materials, projection, lighting, animation, etc.</p>\n\n<p>A lot of it was mind blowing, and with such a small group Carlos was able to take time out of the schedule to talk us through some of the projects that he's currently working on.  It also meant that he could go into some of his presentations (such as the Flash on the Beach talk) in much more depth than he normally could.  The little tips and tricks that were divulged have quite obviously been learned over a career making some cutting edge Flash pieces, so to be able to pick them up first hand was great.</p>\n\n<p>Suffice it to say that I'll be doing my best to get my teeth into some examples to put up here based on what we covered and I would recommend that anyone who has the opportunity to go on a course with Carlos do so, you won't regret it.  The guy seriously knows his stuff.</p>\n\n<p>Oh, and the course also wins the award for the best food!  Lunch both days was great, not just the food but the (sometimes quite political) conversation was also really interesting - there were some personalities on the course!</p>"
    },
    {
      "publishedAt": "2009-11-07T20:01:52.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "7th November 2009",
      "year": "2009",
      "month": "11",
      "slug": "fdt-where-have-you-been-all-my-life",
      "title": "FDT, where have you been all my life?",
      "path": "posts/2009-11-fdt-where-have-you-been-all-my-life.html",
      "tags": [
        "Actionscript",
        "FDT",
        "Flash"
      ],
      "content": "<pre><code>I think a lot of people in the Flash community might well roll their eyes at this post but basically I've got to share the awesomeness that is FDT.\n</code></pre>\n\n<p>I took a little trip to London this week (more about that in another post) to take part in a two day, intensive, Advanced Papervision3d course run by Carlos Ulloa. The very first thing everyone did was break out their laptops and get the example code from Carlos (who is a top, top guy).  </p>\n\n<p>Now, he uses FDT, as did a couple of the other people on the course.  I use(d) Flex Builder 3/Flash Builder and so was interested to find out why they didn't (and also why Carlos said \"there's always someone who uses Flex Builder\" as if it's some dirty little software!).</p>\n\n<p>Inspired by the guys on the course, the ease of jumping between classes and previous awareness because of tweets from Seb Lee-Delisle I decided to give FDT a trial.  I sort of wish that I hadn't as I can't really afford to lay out the cash for it right now!</p>\n\n<p>Suffice it to say that the code completion, refactoring, cmd+1 (whatever that feature is called), svn, etc. are all brilliant.  I reckon I've speeded up my Flash development work by about 25% since I started using the demo.</p>\n\n<p>If you're a Flash developer, try it, it's absolutely brilliant*.</p>\n\n<p>*Obviously there are going to be shit bits and perhaps I've not found them yet but compared to Flex Builder it's a great tool and deserves to be considered by any Flash developer that takes their coding environment seriously.</p>"
    },
    {
      "publishedAt": "2009-10-15T06:42:59.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "15th October 2009",
      "year": "2009",
      "month": "10",
      "slug": "good-news-from-youtube-theyve-released-an-as3-chromeless-player",
      "title": "Good news from Youtube, they've released an AS3 Chromeless player!",
      "path": "posts/2009-10-good-news-from-youtube-theyve-released-an-as3-chromeless-player.html",
      "content": "<pre><code>Youtube have just announced ([http://apiblog.youtube.com/2009/10/actionscript-3-youtube-chromeless.html](http://apiblog.youtube.com/2009/10/actionscript-3-youtube-chromeless.html)) the release of the AS3 version of their chromeless player.  This is brilliant news as it means that integrating Youtube video in my projects just lost a massive pain in the arse!! \n</code></pre>\n\n<p>A recent project for I worrked on for The Science Museum (London) required Youtube integration and I can honestly say that working with an AS3 - AS2 wrapper and the general fiddle that was getting everything talking to each other made it one of the most frustrating jobs I've done in a while.  One particularly brilliant gotcha was that even if your code was right, you couldn't check if everything was working until you previewed the swf in a browser, which is crackers!!  The sigh of relief was huge when it all worked, as Youtube integration adds some pretty cool stuff to any project!</p>\n\n<p>This announcement is another nudge to the 'old-school' AS2 developers that they should probably start using AS3.  The AS2 API isn't going anywhere for a few years, but it is officially deprecated so perhaps it's the gentle push that people need to get them using the latest version of the Actionscript language.</p>"
    },
    {
      "publishedAt": "2009-10-13T20:28:09.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "13th October 2009",
      "year": "2009",
      "month": "10",
      "slug": "consuming-web-services-from-adobe-flash-or-now-you-see-me-now-you-dont",
      "title": "Consuming web services from Adobe Flash (or now you see me, now you \tdon't)",
      "path": "posts/2009-10-consuming-web-services-from-adobe-flash-or-now-you-see-me-now-you-dont.html",
      "content": "<pre><code>I wonder if I'm missing something here. Today I tried to setup a flash widget to bring in a feed from Twitter, in the Flash IDE this was, of course, no problem.  I got the data, parsed it and displayed it just how I wanted.  This wasn't quite the case when I deployed to the web (of course).  I was greeted by the usual security error when trying to pull in data from another domain.\n</code></pre>\n\n<p>Freely admitting that I'm not so hot on the intricate details of the Flash security sandbox, I guess this means that Twitter doesn't have a cross domain policy file (seems strange).  So I did the obvious thing, wrote some php that pulled the feed from Twitter so that my little Flash app thought it was coming from my domain.</p>\n\n<p>This little song and dance seems crazy to me, why not just let me get at that xml in the first place? </p>\n\n<p>I can tell a good few hours reading up on this is required, but it just puzzled me.  The solution was easy enough but it seems wholly unecessary.</p>"
    },
    {
      "publishedAt": "2009-10-12T23:45:15.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "13th October 2009",
      "year": "2009",
      "month": "10",
      "slug": "supatronix-halloween-special-30th-october",
      "title": "Supatronix Halloween Special, 30th October",
      "path": "posts/2009-10-supatronix-halloween-special-30th-october.html",
      "tags": [
        "flyer design",
        "supatronix"
      ],
      "content": "<pre><code>Supatronix is bouncing back after the recent closure by Hackney Council of its home for the past year Herbal by moving a short walk down Old Street to The Courtyard.\n</code></pre>\n\n<p>It's a masive shame that Herbal has been closed as it was a great club for a breaks party - small and lively with a great soundsystem.</p>\n\n<p>Never to be downtrodding, Supatronix will march on, spreading the word of breaks across East London and starts it's time in the new gaff with a headline set from Future Funk Squad.</p>\n\n<p>Glen's got a treat in store for the first 50 lucky punters as he's agreed to give each of them a copy of his latest album, absolutely free.</p>\n\n<p>As usual I've chipped in my little bit of help by putting together some flyers for the event.</p>\n\n<p>For more information visit <a href=\"http://www.supatronix.org\">www.supatronix.org</a>  </p>\n\n<p><a href=\"http://ianthomasnet.files.wordpress.com/2009/10/halloweeen-flyer-front-scaled-1000.jpg\"><img src=\"http://ianthomasnet.files.wordpress.com/2009/10/halloweeen-flyer-front-scaled-1000.jpg?w=216\" alt=\"Halloweeen-flyer-front\" title=\"\" /></a>\n<a href=\"http://ianthomasnet.files.wordpress.com/2009/10/halloweeen-flyer-back-scaled-1000.jpg\"><img src=\"http://ianthomasnet.files.wordpress.com/2009/10/halloweeen-flyer-back-scaled-1000.jpg?w=216\" alt=\"Halloweeen-flyer-back\" title=\"\" /></a></p>\n\n<p><a href=\"http://www.ian-thomas.net/supatronix-halloween-special-30th-october\">See the full gallery on Posterous</a></p>"
    },
    {
      "publishedAt": "2009-09-01T22:19:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "1st September 2009",
      "year": "2009",
      "month": "09",
      "slug": "photoshop-text-styles",
      "title": "Photoshop Text Styles",
      "path": "posts/2009-09-photoshop-text-styles.html",
      "tags": [
        "day dreaming",
        "photoshop"
      ],
      "content": "<p>So tonight I was doing some work in Adobe InDesign CS4 and I was messing around with character styles and text frames.  If you've never used InDesign then these are pretty much bread and butter layout tools for type and they are pretty damn good.  The only trouble with them is that once you've used them, you really want them in Photoshop (and Illustrator for that matter).</p>\n\n<p>Doing web work I find that Photoshop really is the best app available for layout and graphical treatment, I love it!  However, I don't love editing text in it, and I certainly don't like trying to change the styling of several areas of text manually.  If only it had some of the awesome text features that come with InDesign, web work would be so much faster!</p>\n\n<p>I guess it's another little dream to add to the pile of \"one day maybe?\"</p>"
    },
    {
      "publishedAt": "2009-09-01T19:09:20.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "1st September 2009",
      "year": "2009",
      "month": "09",
      "slug": "carsonified-top-10-ux-myths",
      "title": "Carsonified  » Top 10 UX Myths",
      "path": "posts/2009-09-carsonified-top-10-ux-myths.html",
      "content": "<blockquote>\n  <p>Every preference which is not really needed is a design choice that I’m offloading to all the users of my product or service.</p>\n</blockquote>\n\n<p>via <a href=\"http://carsonified.com/blog/design/top-10-ux-myths/\">carsonified.com</a></p>\n\n<p>The rest of the article is such a good read for any designer (not just web!) I really recommend it.</p>"
    },
    {
      "publishedAt": "2009-09-01T12:41:00.000Z",
      "publishedAtHuman": "5 years ago",
      "publishedAtFormal": "1st September 2009",
      "year": "2009",
      "month": "09",
      "slug": "some-questions-about-adobe-flash",
      "title": "Some Questions about Adobe Flash",
      "path": "posts/2009-09-some-questions-about-adobe-flash.html",
      "content": "<p>Recently I've been working more and more in Flash with the work getting increasingly complex and code intensive. This got me thinking about dynamic content and Flash's capabilities to work with it.</p>\n\n<p>On a recent project we produced a piece of work that retrieved various xml feeds from a server which in turn ran a custom CMS to allow content to be uploaded that would then be pulled into our Flash content.  It works great and  it feels really good to be hooking up my work to a PHP back-end but my question is this; why should we have to pull in an automatically generated XML feed from PHP (or whatever)?  Would we not be better having the same ability to query databases as you get in server side languages?</p>\n\n<p>I gather than you get database controls (albeit limited) when working with Adobe AIR but why should this side of the Flash Platform be so limited?</p>\n\n<p>Part of me wonders if this is something to do with the lack of security when you publish a SWF file.  Most people in the Flash community know how easy it is to decompile a SWF file and get access to its symbols and code (and even convert the whole thing back into a .fla) so perhaps this is the major hurdle to overcome before we get proper database access from AS3.</p>\n\n<p>This issue of decompiling a SWF has bothered me for some time, and though it is generally accepted that View Source is a great way to learn, this becomes problematic when business logic and explicit details of database locations and passwords are required.  PHP hides this from the end-user as all they see is the result of the script running, decompile a SWF and you get access to the script that does the query as well as the result that is returned.</p>\n\n<p>While XML looks set to be the middle man for dynamic Flash content for the foreseeable future, I hope that Adobe does review the way that SWF files can be made secure and provides database querying functionality at some point.</p>"
    }
  ]
}